window.dndItemLibrary = {

    "Расходники": {
        "Медикаменты":{
            "Бинт": "Восстанавливает 1хп, снимает :bleeding_effect_icon_high:(источник: покупка, лут)",
            "Спрей от ожогов": "вост 1хп, снимает :burn_effect_icon_high:(источник: покупка, лут)",
            "Антибиотик": "вост 1хп, убирает :poisoned_icon:(источник: покупка, лут)",
            "Сушеные резкие травы": "след ход игрок становиться неуязвимым к любым дебафам(источник: покупка, лут)",
            "Аптечный набор": "2 цели, вост 1d6 хп, или 2d4 хп во время отдыха(источник: покупка, лут)",
            "Стимулятор": "вост 1d4ен, накладывает эффект :pressur_effect_icon_high:(источник: покупка, лут)",
            "Адреналин": "личная Скр+2, накладывает эффект :dexterity_effect_icon_high:(источник: покупка, лут)",
            "Дефибриллятор": "воскрешает союзника, тратит 1 батарейку(источник: покупка, лут)"
        },
        "Ловушки":{
            "Дымовая граната": "все кто имеют лов<=2, получают :in_shadow_effect_icon_high: , в облаке 4 на 4 клетки(источник: покупка)",
            "Обычный капкан": "жертва среднего размера получает, 1d4+4 урн +:bleeding_effect_icon_high:+обездвиживание(источник: покупка, лут)",
            "Осколочная граната": "все сущности в радиусе 3 на 3 клетки должны преуспеть в спасброске лов(СЛ 15) иначе получат 1d4 урн + :bleeding_effect_icon_high:(источник: покупка)",
            "Свето-шумовая граната": "все в комнате получают эффект оглохший, и ослепленный если d20>8, на 2 хода(источник: покупка)"
        },
        "Снадобья":{
            "Мятные курительные травы": "делает ваш организм более раслабленным, повышая харизму(+2)(источник: крафт, лут)",
            "Ладан": "группа во время отдыха снимает 1стрс(источник: лут)",
            "Горький лесной отвар": "след день лов+1, след день :poisoned_icon:  длится только до конца боя(источник: крафт, лут)",
            "Едкая похлебка": "снадобье которое за 1 ход наносит 3d8 урн механизмам(источник: крафт)",
            "Энергетик 'Лимонная кислота'": "дает 1d6 ен, можно использовать вместо батареек(источник: покупка, лут)",
            "Кока-кола": "дает 1d6 ен, можно использовать вместо батареек(источник: покупка, лут)",
            "Кокаин": "стрс-5, вост 1d4-1 хп, за каждый оставшийся стрс(источник: покупка)",
            "Марихуана": "стрс -2, хар+2 на один день(источник: покупка)",
            "Амфетамин": "начало хода накладывает::dexterity_effect_icon_high:(3хода)"
        },
        "Алкоголь":{
            "Пиво": "Во время отдыха вост 4ен(источник: покупка, лут)",
            "Вино": "Во время отдыха снимает 2 игрокам 1 стрс, вост 1ен(источник: покупка, лут)",
            "Ром": "во время отдыха снимает 3 игрокам 2стрс, начало дня: ен -2(источник: покупка, лут)",
            "Бочонок виски": "во время отдыха группа стрс -3, полностью вост ен(источник: покупка, лут)",
            "Зелье очарования": "накладывает 1 минуту :charming_effect_icon_high: на выпившего зелье, по отношению к персонажу которого, жертва увидит первым после питья(источник: покупка, крафт)"
        },
        "Пламя":{
            "Сигнальный огонь": "позволяет призвать союзника на поле боя где бы он ни был(источник: покупка)"
        },
        "Суб-ингредиенты":{
            "Желтые специи": "след день лов+1(источник: крафт, лут)",
            "Жареный фарш": "след день сил+1(источник: крафт, лут)",
            "Сахар": "вост 1ен(источник: лут)",
            "Соль": "вост 1хп(наносит 1d6урн сущ, типа слизень и нечисть)(источник: лут)",
            "Зеленые специи": "-1хп, вост 1d6ен(источник: лут)",
            "Салатовые специи": "вост 1d4хп(источник: крафт, лут)",
            "Шоколадная стружка": "вост 1d4ен(источник: крафт, лут)",
            "Синие специи": "снимает::poisoned_icon:(источник: покупка, лут)"
        },
        "Мороз":{
            "Замороженное молоко компании№.5": "наносит противнику 1d8урн за каждый дебаф который на нем лежит, снимает с противника все эффекты(размер стака:5)(источник: крафт, покупка)",
            "Ментос": "снимает :blindness_effect_icon_high: во время боя(не занимает место в инвентаре)(источник:лут, покупка)",
            "Шприц обезбола": "снимает 1хп, :arrmor_icon_high: команды +1 на 2 мин(источник:лут, покупка)"
        },
        "Инструменты":{
            "WD - 40": "вост механизмам 1d6 прочности, (если актуальный механизм это маунт, то можно использовать на ходу))(источник:лут, покупка)",
            "Синяя изолента": "вост механизмам 1d6+2 прочности(источник:лут, покупка)"
        },
        "Устройства":{
            "Хлопушка": "накладывает на владельца :provocation_effect_icon_high:(источник:лут)",
            "Петарды": "наносит 1d4урн, снимает эффект в тени, накладывает :blindness_effect_icon_high: )(источник:лут)",
            "Полицейская рация": "если вы находитесь в междумирье или приближенных локациях, позволяет призвать одного бледного полицейского на вашу сторону(источник:покупка)",
            "Сломанный пульт": "Использовав его вы переместитесь на свою предыдидущую позицыю(источник:лут)"
        },
        "Еда":{
            "Нокерс": "вост 1хп",
            "Яблочный пирог": "вост 1d4+2хп",
            "Пончик": "бонус,вост 2хп"
        },
        "Горячие напитки":{
            "Горный чай": "вост 2хп",
            "Кофе": "вост 3ен",
            "Зеленый чай": "вост 1ен"
        },
    },

    "Аксесуари": {
        "Шапки":{
            "Шляпа обезьяны": "акробатика +3",
            "Шляпа мага": "макс ен+1",
            "Высокая шляпа мага": "макс ен+3"
        },
        "Приспособления":{
            "Медиатор": "радиус использования заклов +2",
            "Связка ложек": "в начале боя владелец получает :provocation_effect_icon_high:, если ложек в связке будет достаточно то можно бонусным действием получать :provocation_effect_icon_high:",
            "Фотоаппарат": "бонусным дейтвием, выберите  противника в радиусе двух клеток, на которого хотите наложить :blindness_effect_icon_high:(откат:5)",
            "Острая бритва": "+1 накладываемого :bleeding_effect_icon_high:, -2 макс хп, +1 к вост ен в начале дня",
            "Ржавая бритва": "на отдыхе киньте кубик, если d20 >= 12, вост 3ен, в ином случае -1хп"
        }
    }
};