window.dndItemLibrary = {

    "Расходники": {
        "Медикаменты":{
            "Бинт": "Восстанавливает 1хп и 3хп во время боя, снимает :bleeding_effect_icon_high:(источник: покупка, лут)",
            "Спрей от ожогов": "вост 1хп, снимает :burn_effect_icon_high:(источник: покупка, лут)",
            "Антибиотик": "вост 1хп, убирает :poisoned_icon:, снимает болезни:простуда, отравление(источник: покупка, лут)",
            "Сушеные резкие травы": "след ход игрок становиться неуязвимым к любым дебафам(источник: покупка, лут)",
            "Аптечный набор": "2 цели, вост 1d8 хп, или 2d6 хп во время отдыха, в обоих случаях снимает случайную болезнь, не способно вернуть потеряную конечность(источник: покупка, лут)",
            "Стимулятор": "вост 1d4ен, накладывает эффект :pressur_effect_icon_high:(источник: покупка, лут)",
            "Адреналин": "личная Скр+2, накладывает эффект :dexterity_effect_icon_high:, снимает болезни:помутнение(источник: покупка, лут)",
            "Шприц обезбола": "снимает 1хп, :arrmor_icon_high: команды +1 на 2 мин(источник:лут, покупка)",
            "Дефибриллятор": "воскрешает союзника(источник: покупка, лут)"
        },
        "Ловушки":{
            "Дымовая граната": "все кто имеют лов<=2, получают :in_shadow_effect_icon_high: , в облаке 4 на 4 клетки(источник: покупка)",
            "Обычный капкан": "жертва среднего размера получает, 1d4+4 урн +:bleeding_effect_icon_high:+:prone_effect_icon_high:(источник: покупка, лут)",
            "Осколочная граната": "игнорирует::arrmor_icon_high:, все сущности в радиусе 3 на 3 получают 1d6+4 урн + :bleeding_effect_icon_high:(источник: покупка)",
            "Свето-шумовая граната": "все в комнате получают эффект :blindness_effect_icon_high:, на 2 хода(источник: покупка)"
        },
        "Снадобья":{
            "Мятные курительные травы": "делает ваш организм более раслабленным, повышая харизму(+2), снимает болезни:инсомния(источник: крафт, лут)",
            "Ладан": "группа во время отдыха снимает 1стрс, случайному игроку, снимает случайную психическую болезнь(источник: лут)",
            "Горький лесной отвар": "след день лов+1, след день :poisoned_icon:  длится только до конца боя(источник: крафт, лут)",
            "Едкая похлебка": "снадобье которое за 1 ход наносит 3d8 урн механизмам(источник: крафт)",
            "Энергетик 'Лимонная кислота'": "дает 1d6+2 ен, можно использовать вместо батареек, снимает болезни:глисты(источник: покупка, лут)",
            "Кока-кола": "дает 1d6+2 ен, можно использовать вместо батареек(источник: покупка, лут)",
            "Кокаин": "стрс-3, вост 1d4-1 хп, за каждый оставшийся стрс(источник: покупка)",
            "Марихуана": "стрс -2, хар+2 на один день(источник: покупка)",
            "Амфетамин": "начало хода накладывает::dexterity_effect_icon_high:(3хода)"
        },
        "Алкоголь":{
            "Пиво": "Во время отдыха вост 4ен(источник: покупка, лут)",
            "Вино": "Во время отдыха снимает 2 игрокам 2стрс(источник: покупка, лут)",
            "Ром": "во время отдыха снимает 3 игрокам 3стрс(источник: покупка, лут)",
            "Бочонок виски": "во время отдыха группа снимает 3стрс, полностью вост ен(источник: покупка, лут)",
            "Зелье очарования": "накладывает 1 минуту :charming_effect_icon_high: на выпившего зелье, по отношению к персонажу которого, жертва увидит первым после питья(источник: покупка, крафт)"
        },
        "Пламя":{
            "Сигнальный огонь": "позволяет призвать союзника на поле боя где бы он ни был(источник: покупка)"
        },
        "Суб-ингредиенты":{
            "Желтые специи": "добовляется к еде, след день лов+1(источник: крафт, лут)",
            "Жареный фарш": "добовляется к еде, след день макс хп+3(источник: крафт, лут)",
            "Сахар": "добовляется к еде, вост 1ен(источник: лут)",
            "Соль": "добовляется к еде, вост 1хп(наносит 1d6урн сущ, типа слизень и нечисть)(источник: лут)",
            "Зеленые специи": "добовляется к еде, -1хп, вост 1d6+1ен(источник: лут)",
            "Салатовые специи": "добовляется к еде, вост 1d4хп(источник: крафт, лут)",
            "Шоколадная стружка": "добовляется к еде, вост 1d4+2ен(источник: крафт, лут)",
            "Синие специи": "добовляется к еде, снимает::poisoned_icon:, снимает болезни: отравление(источник: покупка, лут)"
        },
        "Мороз":{
            "Морозные травы": "Снимает::burn_effect_icon_high: x3",
            "Замороженное молоко компании№.5": "наносит противнику 1d8урн за каждый дебаф который на нем лежит, снимает с противника все эффекты(размер стака:5)(источник: крафт, покупка)",
            "Ментос": "снимает :blindness_effect_icon_high: во время боя(источник:лут, покупка)"
        },
        "Инструменты":{
            "WD - 40": "вост механизмам 1d6 прочности, (если актуальный механизм это маунт, то можно использовать на ходу))(источник:лут, покупка)",
            "Синяя изолента": "вост механизмам 1d6 прочности, снимает: плохую изоляцию(источник:лут, покупка)"
        },
        "Устройства":{
            "Хлопушка": "накладывает на владельца :provocation_effect_icon_high:(источник:лут)",
            "Петарды": "наносит 1d4урн, снимает эффект в тени, накладывает :blindness_effect_icon_high: )(источник:лут)",
            "Полицейская рация": "если вы находитесь в междумирье или приближенных локациях, позволяет призвать одного бледного полицейского на вашу сторону(источник:покупка)",
            "Сломанный пульт": "Использовав его вы переместитесь на свою предыдидущую позицыю(источник:лут)"
        },
        "Материалы":{
            "Воск":"воск что обычно используют для создания свечей",
            "Ткань": "пригодится для создания бинтов",
            "Гнилое дерево": "какой смысл в ней?",
            "Дерево": "всегда пригодятся",
            "Травы": "не курительная",
            "Хлам": "если порыться можно найти все что угодно"
        },
        "Еда":{
            "Коробка пицы": "вост всей группе 2хп, если членов группы<3, то вост хп(источник:лут, покупка, готовка)",
            "Бургер": "вост 3хп и 5хп на отдыхе(источник:лут, покупка)",
            "Сухая лопша": "требуется приготовить, на отдыхе, вост 2хп, ее приготовление не снимает 'использования' с казана(источник:лут, покупка)",
            "Гнилое мясо": "-1хп, можно приготовить(источник:лут, покупка)",
            "Хлеб с плесенью": "на отдыхе СЛ:5 вост 2хп, в инном случае -1хп(источник:лут)",
            "Гнилое жаренное мясо": "СЛ:13, вост 2хп, в инном случае -3хп",
            "Мясо": "вост 1хп, можно приготовить(источник:лут, покупка)",
            "Жаренное мясо": "вост 1d4хп и 1d4+2хп на отдыхе",
            "Нокерс": "вост 1хп, и 3хп на отдыхе(источник:лут, покупка)",
            "Яблочный пирог": "вост 1d4+2хп(источник:покупка)",
            "Пончик": "бонусное,вост 2хп(источник:покупка)"
        },
        "Горячие напитки":{
            "Какао": "вост 2ен, снимает 1стрс(источник:лут, покупка)",
            "Горный чай": "вост 2хп(источник:лут, покупка)",
            "Кофе": "вост 3ен(источник:лут, покупка)",
            "Зеленый чай": "вост 1ен(источник:крафт, покупка)"
        },
    },

    "Аксесуари": {
        "Шапки":{
            "Шляпа обезьяны": "акробатика +3",
            "Шляпа мага": "макс ен+1",
            "Высокая шляпа мага": "макс ен+3"
        },
        "Приспособления":{
            "Медиатор": "радиус использования заклов +2",
            "Связка ложек": "в начале боя владелец получает :provocation_effect_icon_high:, если ложек в связке будет достаточно то можно бонусным действием получать :provocation_effect_icon_high:",
            "Фотоаппарат": "бонусным дейтвием, выберите  противника в радиусе двух клеток, на которого хотите наложить :blindness_effect_icon_high:(откат:5)",
            "Острая бритва": "+1 накладываемого :bleeding_effect_icon_high:, -2 макс хп, +1 к вост ен в начале дня",
            "Ржавая бритва": "на отдыхе киньте кубик, если d20 >= 12, вост 3ен, в ином случае -1хп"
        }  
    },

    "Сумки": {
        "Сумка бомжа": "+1 слот инвентаря", 
        "Малый рюкзак": "+1 слот инвентаря", 
        "Сумка скафандра": "+1 слота инвентаря",
        "Аптечка": "дает 3 доп слота для медикаментов",
        "Стойка для специй": "дает доп 5 слота для специй",
        "Чайный сервиз": "дает доп 3 слота для чая",
        "Ремонтный набор": "дает доп 3 слота для интсрументов",
        "Сумка под дефибриллятор": "на один увеличивает кол-во вместимых дефибрилляторов"
    }
};