// Файл library.js
window.dndLibrary = {
    "Инженерия": {
        "Ур1-2": {
            "Юный инженер": "при ремонте механизмов с помощью предметов класса инструменты, позволяет к общей суме хила прочности, также добавить 1d6(ремонт)",
            "Акробатика": "Навык(Лов)",
            "Опасный маневр": "бонусное действие, -2хп, наносит 1д4+2 урн, ближний бой(прием)",
            "Обезоруживание": "бонусное действие, накладывает :vulnerability_effect_icon_high: , если пробиваешь защиту(закл)",
            "Клептомания": "тратишь ход на то что бы стащить у живой сущности 1 мелкий предмет, СЛ: 8 + лов противника(прием)",
            "Занимательная вещ": "проверка рзм: 10, на привале вы можете потратить ночь без сна что бы изучить предмет и получить +1урн к нему, при условии если ранее он был >= 0(изучение)",
            "Запас изоленты": "3ен, у вас есть небольшой запас изоленты что вост механизмам 1d6+1 хп, применить на одном и том же механизме можно только раз в день(закл)",
            "Караман для батарей": "Навык, Слот для батареек +2"
        },
        "Ур3":{
            "Нагрузка мотора": "потратьте 4 хп рабочего механизма, что бы получить преимущество к след броску(прием)",
            "Ловкость рук": "Навык что позвоялет не заметно вороваать чужие предметы(лов)",
            "Поиск слабых мест": "СЛ:4, хозяин получает :dexterity_effect_icon_high:",
            "Теневая рука": "доп слот+1, выберите любой предмет из слота сумки, аксесуаров или рук и тогда это предмет можно будет у вас забрать(или заметить) только если противник пройдет проверку лов: 11, с помехой(закл)",
            "Быстрое латание": "1ен, проверка рзм:6, можете залатать объект если он сломан, после чего он прослужит ровно 1 день, а дальше он получит уровень повреждения на 1 больше чем он имел ранее(ремонт)"
        },
    },

     "Готовка": {
        "Ур1-2": {
           "Погребальное сожжение": "сожгите существо типа: труп, вост 1d4+1 ен себе и одному из союзников(закл)",
           "Понижение градуса": "уменьшает урн объекта на 1d4+1 на 1ход(закл)",
           "Повышение градуса": "огненный урн получаемый обьектом +1d4+1(прием)",
           "Крышка": "бонус, в след ходу вы не можете получить :poisoned_icon: + :burn_effect_icon_high: + :bleeding_effect_icon_high:(закл)",
           "Очищение": "бонусное действие, СЛ:8, избавляет владельца от :poisoned_icon:(помощь)",
           "Прижигание": "снимает :bleeding_effect_icon_high:, наносит 1урн(помощь)",
           "Добавка": "Навык, Позволяет добавить к блюду на одну добавку больше(готовка)",
           "Оптимизация": "СЛ: 17, во время готовки возвращает один из ингредиентов обратно(прием готовки)"
        },
        "Ур3":{
           "Зашивание": "снимает хозяину :bleeding_effect_icon_high:(прием)",
           "Слепой опыт": "вост 1d4+1хп за каждую позитивный эффект себе или союзнику, снимает все позитивные эффекты",
           "Экономный режим": "в конце дня вост транспорту 1d4+2 ен",
           "Мастер нарезки": "Навык, позволяет прибавить еще один d4 к любой нарезке",
           "Полет дракона": "2ен, хозяин: назад 3, все противники впереди, в пределе двух клеток получают::burn_effect_icon_high:(прием)",
           "Острый перец": "2ен, 1d4 урн, 5 ходов атаки противника не имеют стихийного эффекта(закл)",
           "Восточные специи": "3ен, бонусное, запрещают противнику на 1 ход использовать заклы(закл)"
        },

        "Ур4":{
           "Фаер болл": "6ен, СЛ:5, урн по цели 2d4+2, и 1d6, соседним целям(закл)",
           "Любовное зелье": "раз в день позволяет позволяет приготовить 1 Зелье очарование, не используя каких либо ингредиентов(крафт)",
           "Азот": "бонусное, одно существо, выбирите сущ которое ходит после вас и его следующий бросок атаки, спасбросок или проверка характеристики автоматически получает тот же результат d20, который вы только что выбросили в свой ход(закл)"
        },
    },

    "Жестокость": {
        "Ур1-2": {
           "Джеб": "СЛ:7, игнорирует защ, крит=накладывает :vulnerability_effect_icon_high:(рукопашка)(прием)",
           "Взрывной щит": "защ+2(1ход), если след ход противник не пробивает :arrmor_icon_high: хозяина то ему наноситься 1d6+2 урн(стойка)",
           "Сосуд для защиты": "вост 2хп цели, весь урн переноситься на выбранного союзника(2ход)(стойка)",
           "Запугивание": "Навык, Накладывает на врага эффект :stress_effect_icon_high:, если у врага мало хп то запугивание может завершить бой без лишней крови",
           "Приказ пойти нахуй": "1d4урн, заставляет существо пойти нахуй, если есть навык запугиванеи, оно выполняться на цель(закл)",
           "Матерный разряд": "накладывает на вас 2 уровня :provocation_effect_icon_high:(закл)",
           "Охота на ветру": "позволяет прибавить поинты скр транспорта к своему броску урона(прием)",
           "Обман": "Навык, Позволяет обманывать опонента и самого себя(лов)"
        },
        "Ур3":{
           "Рассекания": "Навык, Если в этом ходу основным действием ты атаковал, то бонусным действием ты можешь атаковать другую цель в зоне своей досягаемости но с помехой, перемещение между действиями недопускается(прием ближнего боя)",
           "Подготовка удара": "3ен, накладывает на владельца эффект :pressur_effect_icon_high:(закл)",
           "Таран": "Навык, Удар боком транспорта, не ломает ее",
           "Потрошения": "Навык, Во время нарезки мяса можете добавить к броскам еще d4",
           "Парирование": "5ен, если сущ не пробило вашу :arrmor_icon_high: в свой ход, то вы получаете возможность сразу же ее атаковать в ближнем бою, не потеряв свой основной ход, если атака была загатовленна реакцией, ен не тратиться(стойка)"
           
        },

        "Ур4":{
           "Капкан": "2хп, требуется: :in_shadow_effect_icon_high:, в радиусе 2 метров вы можете нанести всем противникам урон, равный урону вашего оружия, снимает: :in_shadow_effect_icon_high:(прием)"
        },
    },

    "Порядочность": {
        "Ур1-2": {
           "Убеждение": "Навык(рзм)",
           "Укройся за мной": "3ен тратишь ход на то что бы укрыть союзника за собой и тот на 1 ход получил :in_shadow_effect_icon_high:(стойка)",
           "Защитная стойка": ":arrmor_icon_high: +2 (2 хода)(стойка)",
           "Уход в тень": "СЛ:8, владелец получает: :in_shadow_effect_icon_high: (прием)",
           "Чтение сказочки": "СЛ:8, вы можете усыпить сущность(если она не враждебна), если она проваливает спас бросок лов, то она получает :sleepy_effect_icon_high: на 60сек(помощь)",
           "Упущенный момент": "можете воздержаться от хода если выпала 20, при этом вост 4хп и 1ен(прием)",
           "Ствол дерева": "Полное спр перемещению(2хода) :arrmor_icon_high:+2(1 ход)(стойка)",
           "Мелкая помощь": "Мелкая помощь(3ен, бонусное накладывает либо на себя либо на союзника эффект :regen_icon_high: (помощь)"
        },
        "Ур3":{
           "Помощь в атаке": "СЛ:7, накладывает на союзника эффект :pressur_effect_icon_high: (помощь)",
           "Оборот": "Вост 1d4хп, за каждый негативный эффект на игроке, снимает все негативные эффекты(помощь)",
           "Любитель Мяты": "Навык, Позволяет использовать предмет класса: мороз, бонусным дейтсвием",
           "Уход за техникой": "потратьте средний+ отдых, что бы вост механизму 1d4+4 прочности(ремонт)",
           "Скрытность": "Навык, Позволяет без помехи использовать заклы и приемы что накладывают::in_shadow_effect_icon_high:(лов)"
        },

        "Ур4":{
           "Экстренная помощь": "раз в день, если товарищ находится при смерти ты можешь реакцией вост ему 1 хп(помощь)"
        },
    },
    
    "Амбиции": {
        "Ур1-2": {
           "Лёгкий флирт": "СЛ:8, На 12сек налаживает на объект :charming_effect_icon_high: (закл)"
        },
        "Ур3":{
           "Вперёд к славе!": "В первом ходу позволяет всем членам команды, кроме хозяина, прибавить к след проверке 1d4(Боевой закл)",
           "Воодушевление": "2ен, в начале боя или отдыха позволяет снять 1 стрс союзнику(помощь)"
        },
    },

};