window.parsedDndLibrary = window.parsedDndLibrary || {}; // Создаем пустой объект, если его еще нет

// Берем существующий объект и сливаем его с новым
Object.assign(window.parsedDndLibrary, {
"Путеводитель": {
        "Ур1-2": {
            "Выход из тени": {
                type: "Action",
                name: "Выход из тени",
                description: "требуется: :in_shadow_effect_icon_high:, владелець получает: :dexterity_effect_icon_high:, снимает с владельца: :in_shadow_effect_icon_high:(боевой закл)",
                actionType: "боевой закл"
            },
            "Осуждение": {
                type: "Action",
                name: "Осуждение",
                description: "3ен, снимает с цели: :pressur_effect_icon_high: + :dexterity_effect_icon_high:",
                cost: 3,
                costType: "ен"
            },
            "Подъем": {
                type: "Action",
                name: "Подъем",
                description: "бонусным действием позволяет снять любой дебаф либо вост 1хп(боевой закл)",
                actionType: "боевой закл"
            },
            "Оправдания": {
                type: "Action",
                name: "Оправдания",
                description: "+1 стрс, СЛ лов:7, снимает с существа сомнения (прием)",
                difficulty: 7,
                difficultyType: "лов",
                actionType: "прием"
            },
            "Указание": {
                type: "Action",
                name: "Указание",
                description: "вне боя тратит 2ен, выбирете союзника и он сможет добавить 1d4 к своему след броску (помощь)",
                cost: 2,
                costType: "ен",
                actionType: "помощь"
            }
        },
        "Ур3": {
            "Синее знамя": {
                type: "Action",
                name: "Синее знамя",
                description: "проверка рзм:8, выберите цель и ее :arrmor_icon_high: будет -6, на один ход(закл)",
                difficulty: 8,
                difficultyType: "рзм",
                actionType: "закл"
            },
            "Блеск пламени": {
                type: "Action",
                name: "Блеск пламени",
                description: "2ен, если след проверка внимательности проходит в темноте при свете ручного источника освещения то она происходит с преимуществом",
                cost: 2,
                costType: "ен"
            },
            "Пламя истины": {
                type: "Action",
                name: "Пламя истины",
                description: "2ен, снимает :in_shadow_effect_icon_high: + :S_icon: , со всех в радиусе 4 метров, противники в этом радиусе также не могут врать 6 сек",
                cost: 2,
                costType: "ен"
            }
        },
        "Ур4": {}
    },
    "Одержимый": {
        "Ур1-2": {
            "Перо онейроса": {
                type: "Skill",
                name: "Перо онейроса",
                description: "навык, владелец всегда при себе имеете волшебное перо которым можете написать что угодно на чем угодно, сущетсво всегда сможет понять язык на котором написано сообщение, не в зависимотси от его родного языка"
            },
            "Создания подношения": {
                type: "Action",
                name: "Создания подношения",
                description: "на отдыхе, если в комнате отдыха есть котел, можно бесплатно создать одно подношение(крафт)",
                actionType: "крафт"
            },
            "Теневая подмена": {
                type: "Action",
                name: "Теневая подмена",
                description: "в радиусе 5 клеток, бонусным действием можете поменяться с одним из союзников местами, если союзник 'доверенный', то закл можно совершить реакцией, а радиус увеличивается до 7 клеток (закл)",
                actionType: "закл"
            },
            "Подхват": {
                type: "Action",
                name: "Подхват",
                description: "3ен, притягивает врага:3(закл)",
                cost: 3,
                costType: "ен",
                actionType: "закл"
            },
            "Непредвиденный опыт": {
                type: "Action",
                name: "Непредвиденный опыт",
                description: "киньте d20 и в зависимости от выпавшего числа добавьте или отнимите хп себе или союзнику, если d20<10, отнимите [выпавшее число] от своего хп, если d20>10, добавьте [выпавшее число] -8, к хп"
            }
        },
        "Ур3": {
            "Жертва": {
                type: "Action",
                name: "Жертва",
                description: "бонусное: 2хп, владелец получает::bleeding_effect_icon_high:, след ход любое действие на выбор совершается с преимущетсвом(прием)",
                cost: 2,
                costType: "хп",
                actionType: "прием"
            },
            "Подхват": {
                type: "Action",
                name: "Подхват",
                description: "3ен, притягивает врага:3(закл)",
                cost: 3,
                costType: "ен",
                actionType: "закл"
            },
            "Коллективный дисонанс": {
                type: "Action",
                name: "Коллективный дисонанс",
                description: "все союзника рзм -1, приетом хозяен получает получает половину +рзм, от того занчания что в суме потеряла его команда, дейтсвие длится: 18-60сек на выбор(закл)",
                actionType: "закл"
            },
            "Красная свеча": {
                type: "Action",
                name: "Красная свеча",
                description: "3ен, снимает с опонента::pressur_effect_icon_high:+:charming_effect_icon_high:, накладывает::vulnerability_effect_icon_high:(закл)",
                cost: 3,
                costType: "ен",
                actionType: "закл"
            }
        },
        "Ур4": {}
    },
    "Праведник": {
        "Ур1-2": {
            "Атлетика": {
                type: "Action",
                name: "Атлетика",
                description: "позволяет без помехи выполнять тяжелые действия например вскарабкивание, поднятие тяжестей, сильные прыжки"
            },
            "Спас бросок тела": {
                type: "Action",
                name: "Спас бросок тела",
                description: "спасбросок отвечающий за сопрртивление ядам, кровотечению, болезням, не контроируему потоку силы"
            },
            "Энерго щит": {
                type: "Action",
                name: "Энерго щит",
                description: "2ен, Если вторая рука свободна то можно на 5 ход, призвать в нее щит",
                cost: 2,
                costType: "ен"
            },
            "Оборонная тренировка": {
                type: "Action",
                name: "Оборонная тренировка",
                description: "на среднем+ отдыхе заготовить 1d4 разовых блоков(предмет) которые можете использовать реакцией что бы смягчить удар по себе или союзнику"
            },
            "Батино месиво": {
                type: "Skill",
                name: "Батино месиво",
                description: "навык, позволяет добавить в блюдо на одну добавку больше"
            },
            "Успокоение": {
                type: "Action",
                name: "Успокоение",
                description: "СЛ рзм:10, во время отдыха позволяет снять 1 стрс, себе или союзнику (помощь)",
                difficulty: 10,
                difficultyType: "рзм",
                actionType: "помощь"
            },
            "Выходи!": {
                type: "Action",
                name: "Выходи!",
                description: "все противники в радиусе 6 метров, теряют: :in_shadow_effect_icon_high: (прием)",
                actionType: "прием"
            }
        },
        "Ур3": {
            "Подавление страха": {
                type: "Action",
                name: "Подавление страха",
                description: "бонус, СЛ:7, снимаете с себя :stress_effect_icon_high:(прием)",
                difficulty: 7,
                actionType: "прием"
            }
        },
        "Ур5": {
            "Сияние": {
                type: "Action",
                name: "Сияние",
                description: "1d6+1ен, раз в день позволяет полностью вост хп одному любому союзнику, либо себе(закл)",
                cost: 1,
                costType: "ен",
                actionType: "закл"
            }
        }
    },
    "Потрошитель": {
        "Ур1-2": {
            "Спас бросок тела": {
                type: "Action",
                name: "Спас бросок тела",
                description: "спасбросок отвечающий за сопрртивление ядам, кровотечению, болезням, не контроируему потоку силы"
            },
            "Подавление": {
                type: "Action",
                name: "Подавление",
                description: "бонусным действием можно нанести 1d4 в дальнем бою, либо наложить :vulnerability_effect_icon_high:+:prone_effect_icon_high:  на существо(откат:3)(закл)",
                actionType: "закл"
            },
            "Атлетика": {
                type: "Action",
                name: "Атлетика",
                description: "позволяет без помехи выполнять тяжелые действия например вскарабкивание, поднятие тяжестей, сильные прыжки"
            },
            "Чутье крови": {
                type: "Action",
                name: "Чутье крови",
                description: "2ен, позволяет учуять любое существо в радиусе 6 клеток чья :arrmor_icon_high: <= 8, эффекты противника такие как :in_shadow_effect_icon_high: могут повлиять на обнаружение",
                cost: 2,
                costType: "ен"
            },
            "'Дайка я тебе один прием покажу!'": {
                type: "Action",
                name: "'Дайка я тебе один прием покажу!'",
                description: "можете отработать 1 закл на своем союзнике во время перерыва и на весь след день получить +1 к его использованию, если в комнате отдыха есть маникен, может отрабтать прием на нем(прием)",
                actionType: "прием"
            },
            "Угрозы": {
                type: "Action",
                name: "Угрозы",
                description: "СЛ:8, наносит 1d6урн, налаживает :stress_effect_icon_high: на существо",
                difficulty: 8
            }
        },
        "Ур3": {
            "Насыщение кровью": {
                type: "Skill",
                name: "Насыщение кровью",
                description: "навык, при убийстве врага вост 1хп. Если в бою было убито <= 3, конец боя: стрс -1"
            },
            "Искусные насмешки": {
                type: "Action",
                name: "Искусные насмешки",
                description: "СЛ:4, накладывает на вас :provocation_effect_icon_high:х3",
                difficulty: 4
            },
            "Низкий выпад": {
                type: "Action",
                name: "Низкий выпад",
                description: "СЛ лов: 7, требуется: :prone_effect_icon_high:, наносите 1 удар противнику ближним оружием, снимает: :prone_effect_icon_high:",
                difficulty: 7,
                difficultyType: "лов"
            },
            "Недоверие": {
                type: "Action",
                name: "Недоверие",
                description: "вы с модификатором +6 проходите проверку проницательности, но навсегда лешаетесь возможности получить лечение от :regen_icon_high:"
            }
        },
        "Ур4": {
            "Неусидчивость": {
                type: "Skill",
                name: "Неусидчивость",
                description: "навык, макс хп -5, пока на вас нету акс класса Броня вы получаете доп модификатор сил либо лов, равное вашему уровню жестокости",
                modifier: "-5"
            },
            "Страхаебина": {
                type: "Skill",
                name: "Страхаебина",
                description: "навык, любые попытки вас запугать идут с помехой"
            },
            "Неудержимость": {
                type: "Action",
                name: "Неудержимость",
                description: "3ен, 2хп, сил+2, на 30сек (откат:5)",
                cost: 3,
                costType: "ен"
            }
        },
        "Ур5": {
            "Любимый прием": {
                type: "Skill",
                name: "Любимый прием",
                description: "навык, выберете 1 действие типа: прием и вы сможете его использовать его также бонусным действием"
            }
        }
    },
    "Исследователь": {
        "Ур1-2": {
            "Небольшая помощь": {
                type: "Action",
                name: "Небольшая помощь",
                description: "бонусным действием позволяет добавить 1d6, к любой проверке)(откат: 2)"
            },
            "Изготовление приспособления": {
                type: "Action",
                name: "Изготовление приспособления",
                description: "на среднем+ отдыхе может создать случаный предмет класса: приспособление, со СЛ:12, может создать доп ед придмета если в комнате есть: верстат",
                difficulty: 12
            },
            "Стабильное изучение": {
                type: "Skill",
                name: "Стабильное изучение",
                description: "Навык Внимательность +2",
                modifier: "+2"
            },
            "Слабое место рас": {
                type: "Skill",
                name: "Слабое место рас",
                description: "Навык, позволяет выбрать любую расу и в начале боя против нее, получить эффект :S_icon:"
            }
        },
        "Ур3": {
            "Преобразование": {
                type: "Action",
                name: "Преобразование",
                description: "Вост 1d4хп, за каждый негативный эффект и каждый позитивный на игроке, снимает все эффекты"
            },
            "Запас батарей": {
                type: "Skill",
                name: "Запас батарей",
                description: "Навык, слот для батареек +2",
                modifier: "+2"
            },
            "Знание рас": {
                type: "Action",
                name: "Знание рас",
                description: "во время отдыха можешь потратить время что бы заняться изучением определенной расы, а после след день использовать один из их навыков как свой (проверка рзм: 18, но за каждого убитого моба в этот день можешь докинуть еще число 1d6 к своему броску d20)",
                difficulty: 18,
                difficultyType: "рзм"
            }
        },
        "Ур4": {
            "Ловкая рука": {
                type: "Action",
                name: "Ловкая рука",
                description: "бонусное, раз в акт может бросить доп 1d4 к проверке ловкости(помощь)",
                actionType: "помощь"
            }
        },
        "Ур5": {
            "Скрупулёзные заметки": {
                type: "Action",
                name: "Скрупулёзные заметки",
                description: "СЛ:17, Читая книгу связанную с любой чертой, на привале вы можете дополнительно ее изучить, получив на один навык/действие больше(изучение)",
                difficulty: 17,
                actionType: "изучение"
            }
        }
    },
    "Беглец": {
        "Ур1-2": {
            "Всплеск действий": {
                type: "Skill",
                name: "Всплеск действий",
                description: "навык, в начале боя ты можешь использовать предмет ни потеряв ни бонусного ни основного действия"
            },
            "Побег в тень": {
                type: "Action",
                name: "Побег в тень",
                description: "Сл:8+самое высокое значение внимательности у вражеской команды, получаешь :in_shadow_effect_icon_high: (прием)",
                difficulty: 8,
                actionType: "прием"
            },
            "Подготовочная стойка": {
                type: "Action",
                name: "Подготовочная стойка",
                description: "в след ходу получаете +5 к любой проверке (стойка)",
                actionType: "стойка"
            },
            "Отдых у костра": {
                type: "Action",
                name: "Отдых у костра",
                description: "при отдыхе вост доп 2ен либо 1хп на выбор"
            }
        },
        "Ур3": {
            "Схватывает на лету": {
                type: "Action",
                name: "Схватывает на лету",
                description: "-"
            },
            "Покров тени": {
                type: "Action",
                name: "Покров тени",
                description: "попытки получить: :in_shadow_effect_icon_high: , +2"
            },
            "Выступ вперед": {
                type: "Action",
                name: "Выступ вперед",
                description: "вперед 3(не тратит скр), хозяин получает :provocation_effect_icon_high: x2"
            },
            "Опасения": {
                type: "Skill",
                name: "Опасения",
                description: "Навык, при разведке локации можете добавить к проверке внимательности 1d6"
            }
        },
        "Ур4": {
            "Неожиданный ход": {
                type: "Action",
                name: "Неожиданный ход",
                description: "бонусное, раз в день может добавить 1d10 к любой проверке"
            }
        },
        "Ур5": {
            "Мелкая моторика": {
                type: "Action",
                name: "Мелкая моторика",
                description: "раз в акт бонусным действием можно совершить любое действие не затрачивающее ен"
            }
        }
    }
});