window.parsedDndLibrary = window.parsedDndLibrary || {}; // Создаем пустой объект, если его еще нет

// Берем существующий объект и сливаем его с новым
Object.assign(window.parsedDndLibrary, {
    "Вражденное": {
        "Крепко сбитый": {
            type: "Skill",
            name: "Крепко сбитый",
            description: "навык, штрафы которые отнимают до -1сил, больше на вас не действуют, исключение: болезни"
        },
        "Грубая кожа": {
            type: "Skill",
            name: "Грубая кожа",
            description: "навык, макс хп+1",
            modifier: "+1"
        },
        "Мускулатура": {
            type: "Skill",
            name: "Мускулатура",
            description: "навык, сил +1",
            modifier: "+1"
        },
        "Ловкие ступни": {
            type: "Skill",
            name: "Ловкие ступни",
            description: "навык, что позволяет использовать предметы из личного инвентаря бонусным действием"
        },
        "Чутье паутины": {
            type: "Skill",
            name: "Чутье паутины",
            description: "навык, позволяет ощущать собой же произведенную паутину в радиусе 10 клеток"
        },
        "Переваренная дичь": {
            type: "Action",
            name: "Переваренная дичь",
            description: "8ен, СЛ:10, съев больше трех средних трупов(один большой труп счиатеться за двух средних, а один маленький за половину среднего), может выблевать переваренную жыдкость в рот другому существу востановив ему 3d4+4хп",
            difficulty: 10,
            cost: 8,
            costType: "ен"
        },
        "Красивая внешность": {
            type: "Skill",
            name: "Красивая внешность",
            description: "навык, харизма +2",
            modifier: "+2"
        },
        "Харизма": {
            type: "Skill",
            name: "Харизма",
            description: "навык которы позволяет в общем более успешно проводить общение с другими разумными сущетсвами"
        },
        "Амфибия": {
            type: "Skill",
            name: "Амфибия",
            description: "навык, позволяет дишать под водой так же как и на земле"
        },
        "Ночное зрение": {
            type: "Skill",
            name: "Ночное зрение",
            description: "навык что позволяет видить в темноте"
        },
        "Вскарабкивание": {
            type: "Skill",
            name: "Вскарабкивание",
            description: "навык позволяющий не на долго оставаться на вертикальных поверхностях(акробатика)",
            stat: "акробатика"
        },
        "Цепкий язык": {
            type: "Action",
            name: "Цепкий язык",
            description: "бонусным действие, позволяет хватать предметы в пределе 3 клеток(прием)",
            actionType: "прием"
        }
    },
    "Магия": {
        "Глиф огня": {
            type: "Action",
            name: "Глиф огня",
            description: "4ен, 1d6+2, накладывает::burn_effect_icon_high: создает поток огня высотой полтора метра(закл)",
            cost: 4,
            costType: "ен",
            actionType: "закл"
        },
        "Глиф льда": {
            type: "Action",
            name: "Глиф льда",
            description: "2ен СЛ:4 опускает температру области воздейтсвия ниже -10 градусов, за 6 секунд(закл)",
            difficulty: 4,
            cost: 2,
            costType: "ен",
            actionType: "закл"
        },
        "Глиф земли": {
            type: "Action",
            name: "Глиф земли",
            description: "2ен,  стиумулирует рост семян травянистых растений, при этом снижая их репродуктивную функцию(закл)",
            cost: 2,
            costType: "ен",
            actionType: "закл"
        },
        "Глиф света": {
            type: "Action",
            name: "Глиф света",
            description: "2ен, СЛ:2 создает пучок света что парит над местом призыва, радиус освещения 2м(закл)",
            difficulty: 2,
            cost: 2,
            costType: "ен",
            actionType: "закл"
        },
        "Трикветр ветра": {
            type: "Action",
            name: "Трикветр ветра",
            description: "СЛ:6, создает сильный поток воздуха что может немного передвигать обьекты(закл)",
            difficulty: 6,
            actionType: "закл"
        },
        "Трикветр молнии": {
            type: "Action",
            name: "Трикветр молнии",
            description: "5ен, СЛ:5, 2d4урн, Создает поток энергии, ищущий ближайший объект для разряда, накладывает: :electrified_effect_icon_high:(закл)",
            difficulty: 5,
            cost: 5,
            costType: "ен",
            actionType: "закл"
        },
        "Трикверт льда": {
            type: "Action",
            name: "Трикверт льда",
            description: "полностью покрывает выбраную клетку в зоне досегаемости снегом(закл)",
            actionType: "закл"
        },
        "Создание сигилов": {
            type: "Skill",
            name: "Создание сигилов",
            description: "навык позволяющий создавать сигилы, 1 сигил на одном среднем+ отдыхе"
        },
        "Сигил огня": {
            type: "Action",
            name: "Сигил огня",
            description: "урон от огня +1d4, защ -1"
        },
        "Сигил ветра": {
            type: "Action",
            name: "Сигил ветра",
            description: "лов+1, макс хп-2"
        },
        "Сигил грома": {
            type: "Action",
            name: "Сигил грома",
            description: "+1 накладываемого :stress_effect_icon_high:, использования запугивания накалдывает на владельца: :provocation_effect_icon_high:"
        },
        "Ведьмин вард": {
            type: "Action",
            name: "Ведьмин вард",
            description: "2хп, на отдыхе создайте охранный знак и человек на посту получит +3 к внимательности(закл)",
            cost: 2,
            costType: "хп",
            actionType: "закл"
        },
        "Магический берсерк": {
            type: "Action",
            name: "Магический берсерк",
            description: "5ен, след 60 сек трикветры и глифы не тратят ен(боевой закл)",
            cost: 5,
            costType: "ен",
            actionType: "боевой закл"
        }
    },
    "Болезни": {
        "Инсомния": {
            type: "Action",
            name: "Инсомния",
            description: "полностью имунны к :sleepy_effect_icon_high:, на отдыхе вост на 2ен и 2хп меньше"
        },
        "Глисты": {
            type: "Action",
            name: "Хламидии",
            description: "при поедании еды шанс 3к20 что ее эффект не сработает"
        },
        "Простуда": {
            type: "Action",
            name: "Простуда",
            description: "блокирует востанавление хп во время отдыха"
        },
        "Сильный кашель": {
            type: "Action",
            name: "Сильный кашель",
            description: "сил -1"
        },
        "Хрупкие кости": {
            type: "Action",
            name: "Хрупкие кости",
            description: "защ -1"
        },
        "Помутнение": {
            type: "Action",
            name: "Помутнение",
            description: "рзм -1"
        },
        "Жесткие колени": {
            type: "Action",
            name: "Жесткие колени",
            description: "лов -1"
        },
        "Брюшной тиф": {
            type: "Action",
            name: "Брюшной тиф",
            description: "начало дня -1макс хп"
        },
        "Отравление": {
            type: "Action",
            name: "Отравление",
            description: "начало дня -1хп, начало акта получаете::poisoned_icon:"
        },
        "Сифилис": {
            type: "Action",
            name: "Сифилис",
            description: "макс хп -3, макс ен -4"
        }
    }
});
