// Файл library.js
window.dndLibrary = {
    "Инженерия": {
         "Знание базовых механизмов": "Позволяет распозновать инструменты, механизмы, металы и определять их проктичность",
        "Ур1-2": {
            "Взлом": "навык что позволяет лвзламывать замки и двери используя ловкость и приминяя отмычки",
            "Юный инженер": "при ремонте механизмов с помощью предметов класса инструменты, позволяет к общей суме хила прочности, также добавить 1d6(ремонт)",
            "Акробатика": "навык(Лов)",
            "Опасный маневр": "бонусное действие, -2хп, наносит 1д4+2 урн, ближний бой(прием)",
            "Обезоруживание": "бонусное действие, накладывает :vulnerability_effect_icon_high: , если пробиваешь защиту(закл)",
            "Клептомания": "тратишь ход на то что бы стащить у живой сущности 1 мелкий предмет, СЛ: 8 + лов противника(прием)",
            "Занимательная вещ": "проверка рзм: 10, на привале вы можете потратить ночь без сна что бы изучить предмет и получить +1урн к нему, при условии если ранее он был >= 0(изучение)",
            "Запас изоленты": "3ен, у вас есть небольшой запас изоленты что вост механизмам 1d6+1 хп, применить на одном и том же механизме можно только раз в день(закл)",
            "Караман для батарей": "навык, Слот для батареек +2"
        },
        "Ур3":{
            "Оглушение": "3ен, накладывает :stupefaction_effect_icon_hight:(прием)",
            "Опутывание": "СЛ:6, 2ен, накладывает :prone_effect_icon_high:",
            "Нагрузка мотора": "потратьте 4 хп рабочего механизма, что бы получить преимущество к след броску(прием)",
            "Ловкость рук": "навык что позвоялет не заметно вороваать чужие предметы(лов)",
            "Поиск слабых мест": "СЛ:4, хозяин получает :dexterity_effect_icon_high:",
            "Теневая рука": "доп слот+1, выберите любой предмет из слота сумки, аксесуаров или рук и тогда это предмет можно будет у вас забрать(или заметить) только если противник пройдет проверку лов: 11, с помехой(закл)",
            "Быстрое латание": "1ен, проверка рзм:6, можете залатать объект если он сломан, после чего он прослужит ровно 1 день, а дальше он получит уровень повреждения на 1 больше чем он имел ранее(ремонт)"
        },
        "Ур4":{
           "Животный рефлекс": "навык, 6ен, на долгом отдыхе можете заготовить одно действие и использовать его раз в день не потеряв основное действие"
         },
         "Ур5":{
           "Зачар": "7ен, на долгом отдыхе, позволяет выбрать одно оружие, которое при СЛ:16, будет накладывать один из след эффектов на выбор: :bleeding_effect_icon_high: :electrified_effect_icon_high: :burn_effect_icon_high: :poisoned_icon:"
         },

         "Расовое":{
            "Природная ловкость": "ловкость +2"
         },
    },

     "Готовка": {
      "Распознавание еды": "Повзоляет определяет сьедобность обьекта и его возможные эффекты",
        "Ур1-2": {
           "Погребальное сожжение": "сожгите существо типа: труп, вост 1d4+1 ен себе и одному из союзников(закл)",
           "Понижение градуса": "уменьшает урн объекта на 1d4+1 на 1ход(закл)",
           "Повышение градуса": "огненный урн получаемый обьектом +1d4+1(прием)",
           "Крышка": "бонус, в след ходу вы не можете получить :poisoned_icon: + :burn_effect_icon_high: + :bleeding_effect_icon_high:(закл)",
           "Очищение": "бонусное действие, СЛ:8, избавляет владельца от :poisoned_icon:(помощь)",
           "Прижигание": "снимает :bleeding_effect_icon_high:, наносит 1урн(помощь)",
           "Добавка": "навык, Позволяет добавить к блюду на одну добавку больше(готовка)",
           "Оптимизация": "СЛ: 17, во время готовки возвращает один из ингредиентов обратно(прием готовки)"
        },
        "Ур3":{
           "Зашивание": "снимает хозяину :bleeding_effect_icon_high:(прием)",
           "Слепой опыт": "вост 1d4+1хп за каждую позитивный эффект себе или союзнику, снимает все позитивные эффекты",
           "Экономный режим": "в конце дня вост транспорту 1d4+2 ен",
           "Мастер нарезки": "навык, позволяет прибавить еще один d4 к любой нарезке",
           "Полет дракона": "2ен, хозяин: назад 3, все противники впереди, в пределе двух клеток получают::burn_effect_icon_high:(прием)",
           "Острый перец": "2ен, 1d4 урн, 5 ходов атаки противника не имеют стихийного эффекта(закл)",
           "Восточные специи": "3ен, бонусное, запрещают противнику на 1 ход использовать заклы(закл)"
        },

        "Ур4":{
           "Зельеварение": "на среднем+ отдыхе может сделать случайное зелье из свеого списка рецептов(крафт)",
           "Счастливый случай": "навык, Востанавливает 2хп при двадцатке",
           "Фаер болл": "6ен, СЛ:5, урн по цели 2d4+2, и 1d6, соседним целям(закл)",
           "Любовное зелье": "раз в день позволяет позволяет приготовить 1 Зелье очарование, не используя каких либо ингредиентов(крафт)",
           "Азот": "бонусное, одно существо, выбирите сущ которое ходит после вас и его следующий бросок атаки, спасбросок или проверка характеристики автоматически получает тот же результат d20, который вы только что выбросили в свой ход(закл)"
        },

         "Ур5":{
           "Начинающий настрой": "навык, 5ен, раз в день можно моментально приготовить 1 блюдо, без каких лиюо затрат"
         },

         "Расовое":{
         },

    },

    "Жестокость": {
        "Ур1-2": {
           "Джеб": "СЛ:7, имеет урон рукопашки, игнорирует защ, крит=накладывает :vulnerability_effect_icon_high:(прием)",
           "Взрывной щит": "защ+2(1ход), если след ход противник не пробивает :arrmor_icon_high: хозяина то ему наноситься 1d6+2 урн(стойка)",
           "Сосуд для защиты": "вост 2хп цели, весь урн переноситься на выбранного союзника(2ход)(стойка)",
           "Запугивание": "навык, Накладывает на врага эффект :stress_effect_icon_high:, если у врага мало хп то запугивание может завершить бой без лишней крови",
           "Приказ пойти нахуй": "1d4урн, заставляет существо пойти нахуй, если есть навык запугиванеи, оно выполняться на цель(закл)",
           "Матерный разряд": "накладывает на вас 2 уровня :provocation_effect_icon_high:(закл)",
           "Охота на ветру": "позволяет прибавить поинты скр транспорта к своему броску урона(прием)",
           "Обман": "навык, Позволяет обманывать опонента и самого себя(лов)"
        },
        "Ур3":{
           "Удар с локтя": "имеет урон рукопашки, если противник имеет: :vulnerability_effect_icon_high:, урн +1d4(прием)",
           "Удар поддых": "навык, что позволяет нанести на 1d4 урона больше в первый ход, в ближнем бою, макс ен -2",
           "Кулаки чешутся": "навык, раз в день можно совершить, один прием бонусным действием",
           "Рассекания": "Навык, Если в этом ходу основным действием ты атаковал, то бонусным действием ты можешь атаковать другую цель в зоне своей досягаемости но с помехой, перемещение между действиями недопускается(прием ближнего боя)",
           "Подготовка удара": "3ен, накладывает на владельца эффект :pressur_effect_icon_high:(закл)",
           "Таран": "Навык, Удар боком транспорта, не ломает ее",
           "Потрошения": "Навык, Во время нарезки мяса можете добавить к броскам еще d4",
           "Парирование": "5ен, если сущ не пробило вашу :arrmor_icon_high: в свой ход, то вы получаете возможность сразу же ее атаковать в ближнем бою, не потеряв свой основной ход, если атака была загатовленна реакцией, ен не тратиться(стойка)"
           
        },

        "Ур4":{
           "Поспешность": "навык, макс хп -1, при двадцатке получаешь второй бонусный ход",
           "Капкан": "2хп, требуется: :in_shadow_effect_icon_high:, в радиусе 2 метров вы можете нанести всем противникам урон, равный урону вашего оружия, снимает: :in_shadow_effect_icon_high:(прием)"
        },

        "Ур5":{
           "Жестокий план": "3ен, реакцией, можно перенести весь полученный урн со варга, на союзника(прием)"
         },

         "Расовое":{
            "Ядовитый плевок": "3ен, 1d4урн, накладывает 2 уровня :poisoned_icon:"
         },
    },

    "Порядочность": {
        "Внимательность": "Навык что позволяет вам лучше замечать скрытые опасности и нужные предметы а таккже находить мелкие детали",
        "Ур1-2": {
           "Второе дыхание": "СЛ:5, бонусное действие, союзник получает +2 к след броску закла(прием)",
           "Убеждение": "Навык(рзм)",
           "Укройся за мной": "3ен тратишь ход на то что бы укрыть союзника за собой и тот на 1 ход получил :in_shadow_effect_icon_high:(стойка)",
           "Защитная стойка": ":arrmor_icon_high: +2 (2 хода)(стойка)",
           "Уход в тень": "СЛ:8, владелец получает: :in_shadow_effect_icon_high: (прием)",
           "Чтение сказочки": "СЛ:8, вы можете усыпить сущность(если она не враждебна), если она проваливает спас бросок лов, то она получает :sleepy_effect_icon_high: на 60сек(помощь)",
           "Упущенный момент": "можете воздержаться от хода если выпала 20, при этом вост 4хп и 1ен(прием)",
           "Ствол дерева": "Полное спр перемещению(2хода) :arrmor_icon_high:+2(1 ход)(стойка)",
           "Мелкая помощь": "Мелкая помощь(3ен, бонусное накладывает либо на себя либо на союзника эффект :regen_icon_high: (помощь)"
        },
        "Ур3":{
           "Помощь в атаке": "СЛ:7, накладывает на союзника эффект :pressur_effect_icon_high: (помощь)",
           "Оборот": "Вост 1d4хп, за каждый негативный эффект на игроке, снимает все негативные эффекты(помощь)",
           "Любитель Мяты": "Навык, Позволяет использовать предмет класса: мороз, бонусным дейтсвием",
           "Уход за техникой": "потратьте средний+ отдых, что бы вост механизму 1d4+4 прочности(ремонт)",
           "Скрытность": "Навык, Позволяет без помехи использовать заклы и приемы что накладывают::in_shadow_effect_icon_high:(лов)"
        },

        "Ур4":{
           "Раздумья": "в след ходу не атакующие заклы, или действия типа: помощь, совершаются с преимуществом(закл)",
           "Экстренная помощь": "раз в день, если товарищ находится при смерти ты можешь реакцией вост ему 1 хп(помощь)"
        },
        "Ур5":{
           "Второй шанс": "навык, находясь при смерти вост 1d4 хп, работает раз в день"
        },

         "Расовое":{
         },
    },
    
    "Амбиции": {
        "Ур1-2": {
           "Задержка": "СЛ:2, 3ен, Бонусное действие, противник пропускает ход но в след раунде имеет в 2 раза больше ходов(закл)",
           "Лёгкий флирт": "СЛ:8, На 12сек налаживает на объект :charming_effect_icon_high: (закл)"
        },
        "Ур3":{
           "Вперёд к славе!": "В первом ходу позволяет всем членам команды, кроме хозяина, прибавить к след проверке 1d4(Боевой закл)",
           "Воодушевление": "2ен, в начале боя или отдыха позволяет снять 1 стрс союзнику(помощь)"
        },
        "Ур4":{
         "Любимчик": "навык, в конце игры получает бонусные 30 опыта",
        },
        "Ур5":{
         "Отчаянный рывок": "4хп, если игрок имеет меньше 6хп, он получает доп ход(закл)",
        },

        "Расовое":{
        },
    },

    "Вражденное": {
       "Бодание": "бонусное, противник: назад 3",
       "Ловкие ступни": "навык, что позволяет использовать предметы из личного инвентаря бонусным действием",
       "Чутье паутины": "навык, позволяет ощущать собой же произведенную паутину в радиусе 10 клеток",
       "Переваренная дичь": "8ен, СЛ:10, съев больше трех средних трупов(один большой труп счиатеться за двух средних, а один маленький за половину среднего), может выблевать переваренную жыдкость в рот другому существу востановив ему 3d4+4хп",
       "Красивая внешность": "харихма +2",
       "Харизма": "навык которы позволяет в общем более успешно проводить общение с другими разумными сущетсвами",
       "Амфибия": "навык, позволяет дишать под водой так же как и на земле",
       "Ночное зрение": "навык что позволяет видить в темноте",
       "Вскарабкивание": "навык позволяющий не на долго оставаться на вертикальных поверхностях(акробатика)",
       "Цепкий язык": "бонусным действие, позволяет хватать предметы в пределе 3 клеток(прием)"
    },

    "Формулы рун": {
       "Глиф огня": "4ен, 1d6+2, накладывает::burn_effect_icon_high: создает поток огня высотой полтора метра",
       "Глиф льда": "2ен СЛ:4 опускает температру области воздейтсвия ниже -10 градусов, за 6 секунд",
       "Глиф земли": "2ен,  стиумулирует рост семян травянистых растений, при этом снижая их репродуктивную функцию",
       "Глиф света": "2ен, СЛ:2 создает пучок света что парит над местом призыва, радиус освещения 2м",
       "Трикветр ветра": "СЛ:6, создает сильный поток воздуха что может немного передвигать обьекты",
       "Трикветр молнии": "5ен, СЛ:7, 2d4урн, Создает поток энергии, ищущий ближайший объект для разряда, накладывает: :electrified_effect_icon_high:",
       "Трикверт льда": "полностью покрывает выбраную клетку в зоне досегаемости снегом",
       "Сигил огня": "урон от огня +1d4, защ -1",
       "Сигил ветра": "лов+1, макс хп-2",
       "Сигил грома": "+1 накладываемого :stress_effect_icon_high:, использования запугивания накалдывает на владельца: :provocation_effect_icon_high:",
       "Ведьмин вард": "2хп, на отдыхе создайте охранный знак и человек на посту получит +3 к внимательности",

    }

};