// Файл library.js
window.dndLibrary = {
    "Инженерия": {
         "Знание базовых механизмов": "Позволяет распозновать инструменты, механизмы, металы и определять их проктичность",
        "Ур1-2": {
            "Шитье": "при на наличии волокон позволяет создавать предметы класификации: ткани(напрмиер бинты или сети, походная ткань)",
            "Взлом": "навык что позволяет лвзламывать замки и двери используя ловкость и приминяя отмычки",
            "Юный инженер": "при ремонте механизмов с помощью предметов класса инструменты, позволяет к общей суме хила прочности, также добавить 1d6(ремонт)",
            "Акробатика": "навык(Лов)",
            "Опасный маневр": "бонусное действие, -2хп, наносит 1д4+2 урн, ближний бой(прием)",
            "Обезоруживание": "бонусное действие, накладывает :vulnerability_effect_icon_high: , если пробиваешь защиту(закл)",
            "Клептомания": "тратишь ход на то что бы стащить у живой сущности 1 мелкий предмет, СЛ: 8 + лов противника(прием)",
            "Занимательная вещ": "проверка рзм: 10, на привале вы можете потратить ночь без сна что бы изучить предмет и получить +1урн к нему, при условии если ранее он был >= 0(изучение)",
            "Запас изоленты": "3ен, у вас есть небольшой запас изоленты что вост механизмам 1d6+1 хп, применить на одном и том же механизме можно только раз в день(закл)",
            "Караман для батарей": "навык, Слот для батареек +2"
        },
        "Ур3":{
            "Оглушение": "3ен, накладывает :stupefaction_effect_icon_hight:, ближний бой(прием)",
            "Опутывание": "СЛ:6, 2ен, накладывает :prone_effect_icon_high:",
            "Нагрузка мотора": "потратьте 4 хп рабочего механизма, что бы получить преимущество к след броску(прием)",
            "Ловкость рук": "навык что позвоялет не заметно вороваать чужие предметы(лов)",
            "Поиск слабых мест": "СЛ:4, хозяин получает :dexterity_effect_icon_high:",
            "Теневая рука": "доп слот+1, выберите любой предмет из слота сумки, аксесуаров или рук и тогда это предмет можно будет у вас забрать(или заметить) только если противник пройдет проверку лов: 11, с помехой(закл)",
            "Быстрое латание": "1ен, проверка рзм:6, можете залатать объект если он сломан, после чего он прослужит ровно 1 день, а дальше он получит уровень повреждения на 1 больше чем он имел ранее(ремонт)"
        },
        "Ур4":{
           "Животный рефлекс": "навык, 6ен, на долгом отдыхе можете заготовить одно действие и использовать его раз в день не потеряв основное действие"
         },
         "Ур5":{
           "Зачар": "7ен, на долгом отдыхе, позволяет выбрать одно оружие, которое при СЛ:16, будет накладывать один из след эффектов на выбор: :bleeding_effect_icon_high: :electrified_effect_icon_high: :burn_effect_icon_high: :poisoned_icon:"
         },

         "Расовое":{
            "Природная ловкость": "ловкость +2"
         },
    },

     "Готовка": {
      "Распознавание еды": "Повзоляет определяет сьедобность обьекта и его возможные эффекты",
        "Ур1-2": {
           "Погребальное сожжение": "сожгите существо типа: труп, вост 1d4+1 ен себе и одному из союзников(закл)",
           "Понижение градуса": "уменьшает урн объекта на 1d4+1 на 1ход(закл)",
           "Повышение градуса": "огненный урн получаемый обьектом +1d4+1(прием)",
           "Крышка": "бонус, в след ходу вы не можете получить :poisoned_icon: + :burn_effect_icon_high: + :bleeding_effect_icon_high:(закл)",
           "Очищение": "бонусное действие, СЛ:8, избавляет владельца от :poisoned_icon:(помощь)",
           "Прижигание": "снимает :bleeding_effect_icon_high:, наносит 1урн(помощь)",
           "Добавка": "навык, Позволяет добавить к блюду на одну добавку больше(готовка)",
           "Оптимизация": "СЛ: 17, во время готовки возвращает один из ингредиентов обратно(прием готовки)"
        },
        "Ур3":{
           "Зашивание": "снимает хозяину :bleeding_effect_icon_high:(прием)",
           "Слепой опыт": "вост 1d4+1хп за каждую позитивный эффект себе или союзнику, снимает все позитивные эффекты",
           "Экономный режим": "в конце дня вост транспорту 1d4+2 ен",
           "Мастер нарезки": "навык, позволяет прибавить еще один d4 к любой нарезке",
           "Полет дракона": "2ен, хозяин: назад 3, все противники впереди, в пределе двух клеток получают::burn_effect_icon_high:(прием)",
           "Острый перец": "2ен, 1d4 урн, 5 ходов атаки противника не имеют стихийного эффекта(закл)",
           "Восточные специи": "3ен, бонусное, запрещают противнику на 1 ход использовать заклы(закл)"
        },

        "Ур4":{
           "Зельеварение": "на среднем+ отдыхе может сделать случайное зелье из свеого списка рецептов(крафт)",
           "Счастливый случай": "навык, Востанавливает 2хп при двадцатке",
           "Фаер болл": "6ен, СЛ:5, урн по цели 2d4+2, и 1d6, соседним целям(закл)",
           "Любовное зелье": "раз в день позволяет позволяет приготовить 1 Зелье очарование, не используя каких либо ингредиентов(крафт)",
           "Азот": "бонусное, одно существо, выбирите сущ которое ходит после вас и его следующий бросок атаки, спасбросок или проверка характеристики автоматически получает тот же результат d20, который вы только что выбросили в свой ход(закл)"
        },

         "Ур5":{
           "Начинающий настрой": "навык, 5ен, раз в день можно моментально приготовить 1 блюдо, без каких лиюо затрат"
         },

         "Расовое":{
         },

    },

    "Жестокость": {
        "Ур1-2": {
           "Джеб": "СЛ:7, имеет урон рукопашки, игнорирует защ, крит=накладывает :vulnerability_effect_icon_high:(прием)",
           "Взрывной щит": "защ+2(1ход), если след ход противник не пробивает :arrmor_icon_high: хозяина то ему наноситься 1d6+2 урн(стойка)",
           "Сосуд для защиты": "вост 2хп цели, весь урн переноситься на выбранного союзника(2ход)(стойка)",
           "Запугивание": "навык, Накладывает на врага эффект :stress_effect_icon_high:, если у врага мало хп то запугивание может завершить бой без лишней крови",
           "Приказ пойти нахуй": "1d4урн, заставляет существо пойти нахуй, если есть навык запугиванеи, оно выполняться на цель(закл)",
           "Матерный разряд": "накладывает на вас 2 уровня :provocation_effect_icon_high:(закл)",
           "Охота на ветру": "позволяет прибавить поинты скр транспорта к своему броску урона(прием)",
           "Обман": "навык, Позволяет обманывать опонента и самого себя(лов)"
        },
        "Ур3":{
           "Удар с локтя": "имеет урон рукопашки, если противник имеет: :vulnerability_effect_icon_high:, урн +1d4(прием)",
           "Удар поддых": "навык, что позволяет нанести на 1d4 урона больше в первый ход, в ближнем бою, макс ен -2",
           "Кулаки чешутся": "навык, раз в день можно совершить, один прием бонусным действием",
           "Рассекания": "Навык, Если в этом ходу основным действием ты атаковал, то бонусным действием ты можешь атаковать другую цель в зоне своей досягаемости но с помехой, перемещение между действиями недопускается(прием ближнего боя)",
           "Подготовка удара": "3ен, накладывает на владельца эффект :pressur_effect_icon_high:(закл)",
           "Таран": "Навык, Удар боком транспорта, не ломает ее",
           "Потрошения": "Навык, Во время нарезки мяса можете добавить к броскам еще d4",
           "Парирование": "5ен, если сущ не пробило вашу :arrmor_icon_high: в свой ход, то вы получаете возможность сразу же ее атаковать в ближнем бою, не потеряв свой основной ход, если атака была загатовленна реакцией, ен не тратиться(стойка)"
           
        },

        "Ур4":{
           "Поспешность": "навык, макс хп -1, при двадцатке получаешь второй бонусный ход",
           "Капкан": "2хп, требуется: :in_shadow_effect_icon_high:, в радиусе 2 метров вы можете нанести всем противникам урон, равный урону вашего оружия, снимает: :in_shadow_effect_icon_high:(прием)"
        },

        "Ур5":{
           "Жестокий план": "3ен, реакцией, можно перенести весь полученный урн со варга, на союзника(прием)"
         },

         "Расовое":{
            "Бодание": "бонусное, противник: назад 3",
            "Ядовитый плевок": "3ен, 1d4урн, накладывает 2 уровня :poisoned_icon:"
         },
    },

    "Порядочность": {
        "Внимательность": "Навык что позволяет вам лучше замечать скрытые опасности и нужные предметы а таккже находить мелкие детали",
        "Ур1-2": {
           "Второе дыхание": "СЛ:5, бонусное действие, союзник получает +2 к след броску закла(прием)",
           "Убеждение": "Навык(рзм)",
           "Укройся за мной": "3ен тратишь ход на то что бы укрыть союзника за собой и тот на 1 ход получил :in_shadow_effect_icon_high:(стойка)",
           "Защитная стойка": ":arrmor_icon_high: +2 (2 хода)(стойка)",
           "Уход в тень": "СЛ:8, владелец получает: :in_shadow_effect_icon_high: (прием)",
           "Чтение сказочки": "СЛ:8, вы можете усыпить сущность(если она не враждебна), если она проваливает спас бросок лов, то она получает :sleepy_effect_icon_high: на 60сек(помощь)",
           "Упущенный момент": "можете воздержаться от хода если выпала 20, при этом вост 4хп и 1ен(прием)",
           "Ствол дерева": "Полное спр перемещению(2хода) :arrmor_icon_high:+2(1 ход)(стойка)",
           "Мелкая помощь": "Мелкая помощь(3ен, бонусное накладывает либо на себя либо на союзника эффект :regen_icon_high: (помощь)"
        },
        "Ур3":{
           "Помощь в атаке": "СЛ:7, накладывает на союзника эффект :pressur_effect_icon_high: (помощь)",
           "Оборот": "Вост 1d4хп, за каждый негативный эффект на игроке, снимает все негативные эффекты(помощь)",
           "Любитель Мяты": "Навык, Позволяет использовать предмет класса: мороз, бонусным дейтсвием",
           "Уход за техникой": "потратьте средний+ отдых, что бы вост механизму 1d4+4 прочности(ремонт)",
           "Скрытность": "Навык, Позволяет без помехи использовать заклы и приемы что накладывают::in_shadow_effect_icon_high:(лов)"
        },

        "Ур4":{
           "Раздумья": "в след ходу не атакующие заклы, или действия типа: помощь, совершаются с преимуществом(закл)",
           "Экстренная помощь": "раз в день, если товарищ находится при смерти ты можешь реакцией вост ему 1 хп(помощь)"
        },
        "Ур5":{
           "Второй шанс": "навык, находясь при смерти вост 1d4 хп, работает раз в день"
        },

         "Расовое":{
            "Слабый телекинез": "позволяет перемещать и поднимать мелкие предметы, ключи, ложки, листы. А также дистанционно двигать передвижные блоки",
         },
    },
    
    "Амбиции": {
        "Ур1-2": {
           "Задержка": "СЛ:2, 3ен, Бонусное действие, противник пропускает ход но в след раунде имеет в 2 раза больше ходов(закл)",
           "Лёгкий флирт": "СЛ:8, На 12сек налаживает на объект :charming_effect_icon_high: (закл)"
        },
        "Ур3":{
           "Вперёд к славе!": "В первом ходу позволяет всем членам команды, кроме хозяина, прибавить к след проверке 1d4(Боевой закл)",
           "Воодушевление": "2ен, в начале боя или отдыха позволяет снять 1 стрс союзнику(помощь)"
        },
        "Ур4":{
         "Любимчик": "навык, в конце игры получает бонусные 30 опыта",
        },
        "Ур5":{
         "Отчаянный рывок": "4хп, если игрок имеет меньше 6хп, он получает доп ход(закл)",
        },

        "Расовое":{
        },
    },

    "Путеводитель": {
        "Ур1-2": {
            "Подъем": "бонусным действием позволяет снять любой дебаф либо вост 1хп(боевой закл)",
            "Оправдания": "+1 стрс, СЛ лов:7, снимает с существа сомнения (прием)",
            "Указание": "вне боя:1ен, выбирете союзника и он сможет добавить 1d4 к своему след броску (помощь)"
        },
        "Ур3": {
            "Синее знамя": "проверка рзм:8, выберите цель и ее :arrmor_icon_high: будет -6, на один ход(закл)",
            "Блеск пламени": "2ен, если след проверка внимательности проходит в темноте при свете ручного источника освещения то она происходит с преимуществом",
            "Пламя истины": "2ен, снимает :in_shadow_effect_icon_high: + :S_icon: , со всех в радиусе 4 метров, противники в этом радиусе также не могут врать 6 сек"
        },
        "Ур4": {
        }
    },

    "Одержимый": {
        "Ур1-2": {
            "Теневая подмена": "в радиусе 5 клеток, бонусным действием можете поменяться с одним из союзников местами, если союзник \"доверенный\", то закл можно совершить реакцией, а радиус увеличивается до 7 клеток (закл)",
            "Подхват": "ен3, притягивает врага",
            "Непредвиденный опыт": "киньте d20 и в зависимости от выпавшего числа добавьте или отнимите хп себе или союзнику, если d20<10, отнимите [выпавшее число] от своего хп, если d20>10, добавьте [выпавшее число] -8, к хп"
        },
        "Ур3": {
        },
        "Ур4": {
        }
    },

    "Праведник": {
        "Ур1-2": {
            "Атлетика": "позволяет без помехи выполнять тяжелые действия например вскарабкивание, поднятие тяжестей, сильные прыжки",
            "Спас бросок тела": "спасбросок отвечающий за сопрртивление ядам, кровотечению, болезням, не контроируему потоку силы",
            "Энерго щит": "2ен, Если вторая рука свободна то можно на 5 ход, призвать в нее щит",
            "Оборонная тренировка": "на среднем+ отдыхе заготовить 1d4 разовых блоков(предмет) которые можете использовать реакцией что бы смягчить удар по себе или союзнику",
            "Батино месиво": "навык, позволяет добавить в блюдо на одну добавку больше",
            "Успокоение": "СЛ рзм:10, во время отдыха позволяет снять 1 стрс, себе или союзнику (помощь)",
            "Выходи!": "все противники в радиусе 6 метров, теряют: :in_shadow_effect_icon_high: (прием)"
        },
        "Ур3": {
            "Подавление страха": "бонус, СЛ:7, снимаете с себя :stress_effect_icon_high:(прием)"
        },
        "Ур5": {
            "Сияние": "1d6+1ен, раз в день позволяет полностью вост хп одному любому союзнику, либо себе(закл)"
        }
    },

    "Потрошитель": {
        "Ур1-2": {
            "Спас бросок тела": "спасбросок отвечающий за сопрртивление ядам, кровотечению, болезням, не контроируему потоку силы",
            "Подавление": "бонусным действием можно нанести 1d4 в дальнем бою, либо наложить :vulnerability_effect_icon_high:+:prone_effect_icon_high:  на существо(откат:3)(закл)",
            "Атлетика": "позволяет без помехи выполнять тяжелые действия например вскарабкивание, поднятие тяжестей, сильные прыжки",
            "Чутье крови": "ен1, позволяет учуять любое существо в радиусе 6 клеток чья :arrmor_icon_high: <= 8, эффекты противника такие как :in_shadow_effect_icon_high: могут повлиять на обнаружение",
            "'Дайка я тебе один прием покажу!'": "можете отработать 1 закл на своем союзнике во время перерыва и на весь след день получить +1 к его использованию",
            "Угрозы": "СЛ:8, наносит 1d6урн, налаживает :stress_effect_icon_high: на существо"
        },
        "Ур3": {
            "Насыщение кровью": "навык, при убийстве врага вост 1хп. Если в бою было убито <= 3, конец боя: стрс -1",
            "Искусные насмешки": "СЛ:4, накладывает на вас :provocation_effect_icon_high:х3",
            "Низкий выпад": "СЛ лов: 7, требуется: :bleeding_effect_icon_high: , наносит 1 удар противнику ближним оружием, снимает: :bleeding_effect_icon_high:",
            "Недоверие": "вы с модификатором +6 проходите проверку проницательности, но навсегда лешаетесь возможности получить лечение от :regen_icon_high:"
        },
        "Ур4": {
            "Неусидчивость": "навык, макс хп -5, пока на вас нету акс класса Броня вы получаете доп модификатор сил либо лов, равное вашему уровню жестокости",
            "Страхаебина": "навык, любые попытки вас запугать идут с помехой",
            "Неудержимость": "3ен, 2хп, сил+2, на 30сек (откат:5)"
        },
        "Ур5": {
            "Любимый прием": "навык, выберете 1 действие типа: прием и вы сможете его использовать его также бонусным действием"
        }
    },

    "Исследователь": {
        "Ур1-2": {
            "Небольшая помощь": "бонусным действием позволяет добавить 1d6, к любой проверке)(откат: 2)",
            "Изготовление приспособления": "на среднем+ отдыхе может создать случаный предмет класса: приспособление, со СЛ:14, может создать доп придемт если в комнате есть: верстат",
            "Преобразование": "Вост 1d4хп, за каждый негативный эффект и каждый позитивный на игроке, снимает все эффекты",
            "Стабильное изучение": "Навык, Внимательность +2",
            "Слабое место рас": "Навык, позволяет выбрать любую расу и в начале боя против нее, получить эффект :S_icon:"
        },
        "Ур3": {
            "Запас батарей": "Навык, слот для батареек +2",
            "Знание рас": "во время отдыха можешь потратить время что бы заняться изучением определенной расы, а после след день использовать один из их навыков как свой (проверка рзм: 18, но за каждого убитого моба в этот день можешь докинуть еще число 1d6 к своему броску d20)"
        },
        "Ур4": {
            "Ловкая рука": "бонусное, раз в акт может бросить доп 1d4 к проверке ловкости(помощь)"
        },
        "Ур5": {
            "Скрупулёзные заметки": "СЛ:17, Читая книгу связанную с любой чертой, на привале вы можете дополнительно ее изучить, получив на один навык/действие больше(изучение)"
        }
    },

    "Беглец": {
        "Ур1-2": {
            "Всплеск действий": "навык, в начале боя ты можешь использовать предмет ни потеряв ни бонусного ни основного действия",
            "Побег в тень": "Сл:8+самое высокое значение внимательности у вражеской команды, получаешь :in_shadow_effect_icon_high: (прием)",
            "Подготовочная стойка": "в след ходу получаете +5 к любой проверке (стойка)",
            "Отдых у костра": "при отдыхе вост доп 2ен либо 1хп на выбор"
        },
        "Ур3": {
            "Схватывает на лету": "-",
            "Покров тени": "попытки получить: :in_shadow_effect_icon_high: , +2",
            "Выступ вперед": "вперед 3, хозяин получает :provocation_effect_icon_high:",
            "Опасения": "Навык, при разведке локации можете добавить к проверке внимательности 1d6"
        },
        "Ур4": {
            "Неожиданный ход": "бонусное, раз в день может добавить 1d10 к любой проверке"
        },
        "Ур5": {
            "Мелкая моторика": "раз в акт бонусным действием можно совершить любое действие не затрачивающее ен"
        }
    },

    "Вражденное": {
       "Мускулатура": "сил +1",
       "Ловкие ступни": "навык, что позволяет использовать предметы из личного инвентаря бонусным действием",
       "Чутье паутины": "навык, позволяет ощущать собой же произведенную паутину в радиусе 10 клеток",
       "Переваренная дичь": "8ен, СЛ:10, съев больше трех средних трупов(один большой труп счиатеться за двух средних, а один маленький за половину среднего), может выблевать переваренную жыдкость в рот другому существу востановив ему 3d4+4хп",
       "Красивая внешность": "харихма +2",
       "Харизма": "навык которы позволяет в общем более успешно проводить общение с другими разумными сущетсвами",
       "Амфибия": "навык, позволяет дишать под водой так же как и на земле",
       "Ночное зрение": "навык что позволяет видить в темноте",
       "Вскарабкивание": "навык позволяющий не на долго оставаться на вертикальных поверхностях(акробатика)",
       "Цепкий язык": "бонусным действие, позволяет хватать предметы в пределе 3 клеток(прием)"
    },

    "Магия": {
       "Глиф огня": "4ен, 1d6+2, накладывает::burn_effect_icon_high: создает поток огня высотой полтора метра(закл)",
       "Глиф льда": "2ен СЛ:4 опускает температру области воздейтсвия ниже -10 градусов, за 6 секунд(закл)",
       "Глиф земли": "2ен,  стиумулирует рост семян травянистых растений, при этом снижая их репродуктивную функцию(закл)",
       "Глиф света": "2ен, СЛ:2 создает пучок света что парит над местом призыва, радиус освещения 2м(закл)",
       "Трикветр ветра": "СЛ:6, создает сильный поток воздуха что может немного передвигать обьекты(закл)",
       "Трикветр молнии": "5ен, СЛ:7, 2d4урн, Создает поток энергии, ищущий ближайший объект для разряда, накладывает: :electrified_effect_icon_high:(закл)",
       "Трикверт льда": "полностью покрывает выбраную клетку в зоне досегаемости снегом(закл)",
       "Создание сигилов": "навык позволяющий создавать сигилы, 1 сигил на одном среднем+ отдыхе",
       "Сигил огня": "урон от огня +1d4, защ -1",
       "Сигил ветра": "лов+1, макс хп-2",
       "Сигил грома": "+1 накладываемого :stress_effect_icon_high:, использования запугивания накалдывает на владельца: :provocation_effect_icon_high:",
       "Ведьмин вард": "2хп, на отдыхе создайте охранный знак и человек на посту получит +3 к внимательности(закл)",
       "Магический берсерк": "5ен, след 60 сек трикветры и глифы не тратят ен(боевой закл)"
    },

};