window.parsedDndLibrary = window.parsedDndLibrary || {}; // Создаем пустой объект, если его еще нет

Object.assign(window.parsedDndLibrary, {
    "Инженерия": {
        "Крафт": {
            type: "Skill",
            description: "Базовое умение соеденять предметы между собой"
        },
        "Ур1-2": {
            "Шитье": {
                type: "Action",
                description: "при на наличии волокон позволяет создавать предметы класификации: ткани(напрмиер бинты или сети, походная ткань), для крафта требуется: верстат"
            },
            "Взлом": {
                type: "Skill",
                description: "навык что позволяет лвзламывать замки и двери используя ловкость и применяя отмычки"
            },
            "Юный инженер": {
                type: "Action",
                description: "при ремонте механизмов с помощью предметов класса инструменты, позволяет к общей суме хила прочности, также добавить 1d6(ремонт)",
                actionType: "ремонт"
            },
            "Акробатика": {
                type: "Skill",
                description: "навык(Лов)",
                stat: "лов"
            },
            "Опасный маневр": {
                type: "Action",
                description: "бонусное действие, -2хп, наносит 1д4+2 урн, ближний бой(прием)",
                cost: 2,
                costType: "хп",
                actionType: "прием"
            },
            "Обезоруживание": {
                type: "Action",
                description: "бонусное действие, накладывает :vulnerability_effect_icon_high: , если пробиваешь защиту(закл)",
                actionType: "закл"
            },
            "Клептомания": {
                type: "Action",
                description: "тратишь ход на то что бы стащить у живой сущности 1 мелкий предмет, СЛ: 8 + лов противника(прием)",
                difficulty: 8,
                actionType: "прием"
            },
            "Занимательная вещ": {
                type: "Action",
                description: "проверка рзм: 10, на привале вы можете потратить ночь без сна что бы изучить предмет и получить +1урн к нему, при условии если ранее он был >= 0(изучение)",
                difficulty: 10,
                difficultyType: "рзм",
                actionType: "изучение"
            },
            "Запас изоленты": {
                type: "Action",
                description: "3ен, у вас есть небольшой запас изоленты что вост механизмам 1d6+1 хп, применить на одном и том же механизме можно только раз в день(закл)",
                cost: 3,
                costType: "ен",
                actionType: "закл"
            },
            "Караман для батарей": {
                type: "Skill",
                description: "навык, Слот для батареек +2",
                modifier: "+2"
            }
        },
        "Ур3": {
            "Заземление": {
                type: "Action",
                description: "2ен, снимает с маханизма эффект плохой изоляции(ремонт)",
                cost: 2,
                costType: "ен",
                actionType: "ремонт"
            },
            "Выключатель": {
                type: "Action",
                description: "СЛ:5, владелец теряет::electrified_effect_icon_high:, механизм получает::stupefaction_effect_icon_hight:, если противник имеет тип:катушка тесла, то он переходит в выключенное состояние(прием)",
                difficulty: 5,
                actionType: "закл"
            },
            "Сапер": {
                type: "Skill",
                description: "навык, получаемый урон от взрывов снижен на 4урн:"
            },
            "Оглушение": {
                type: "Action",
                description: "3ен, накладывает :stupefaction_effect_icon_hight:, ближний бой(прием)",
                cost: 3,
                costType: "ен",
                actionType: "прием"
            },
            "Опутывание": {
                type: "Action",
                description: "2ен, СЛ:6, накладывает :prone_effect_icon_high:(закл)",
                difficulty: 6,
                cost: 2,
                costType: "ен",
                actionType: "закл"
            },
            "Нагрузка мотора": {
                type: "Action",
                description: "потратьте 4 хп рабочего механизма, что бы получить преимущество к след броску(прием)",
                cost: 4,
                costType: "хп",
                actionType: "прием"
            },
            "Ловкость рук": {
                type: "Skill",
                description: "навык что позвоялет не заметно вороваать чужие предметы(лов)",
                stat: "лов"
            },
            "Поиск слабых мест": {
                type: "Action",
                description: "СЛ:4, хозяин получает :dexterity_effect_icon_high:",
                difficulty: 4
            },
            "Теневая рука": {
                type: "Action",
                description: "доп слот+1, выберите любой предмет из слота сумки, аксесуаров или рук и тогда это предмет можно будет у вас забрать(или заметить) только если противник пройдет проверку лов: 11, с помехой(закл)",
                difficulty: 11,
                difficultyType: "лов",
                actionType: "закл"
            },
            "Быстрое латание": {
                type: "Action",
                description: "2ен, проверка рзм:6, можете залатать объект если он сломан, после чего он прослужит ровно 1 день, а дальше он получит уровень повреждения на 1 больше чем он имел ранее(ремонт)",
                difficulty: 6,
                difficultyType: "рзм",
                cost: 2,
                costType: "ен",
                actionType: "ремонт"
            }
        },
        "Ур4": {
            "Случайные иснтрументы": {
                type: "Action",
                description: "4ен, если в комнате отдыха есть верстат, то можете создать 1 случайный предмет класса: инструмент",
                cost: 4,
                costType: "ен"
            },
            "Смена фаз": {
                type: "Action",
                description: "механизм получает :stupefaction_effect_icon_hight: за каждые 2 токена эффекта :electrified_effect_icon_high: на владельце, владелец теряет все::electrified_effect_icon_high:(закл)",
                actionType: "закл"
            },
            "Животный рефлекс": {
                type: "Skill",
                description: "навык, 6ен, на долгом отдыхе можете заготовить одно действие и использовать его раз в день не потеряв основное действие"
            }
        },
        "Ур5": {
            "Зачар": {
                type: "Action",
                description: "7ен, на большом отдыхе, позволяет выбрать одно оружие, которое при СЛ:16, будет накладывать один из след эффектов на выбор: :bleeding_effect_icon_high: :electrified_effect_icon_high: :burn_effect_icon_high: :poisoned_icon:",
                difficulty: 16,
                cost: 7,
                costType: "ен"
            }
        },
        "Расовое": {
            "Природная ловкость": {
                type: "Skill",
                description: "ловкость +2"
            }
        }
    },
    "Готовка": {
        "Готовка": {
            type: "Skill",
            description: "Базовое умение создавать и распознавать еду"
        },
        "Ур1-2": {
            "Погребальное сожжение": {
                type: "Action",
                description: "сожгите существо типа: труп, вост 1d4+1 ен себе и одному из союзников(закл)",
                actionType: "закл"
            },
            "Понижение градуса": {
                type: "Action",
                description: "уменьшает урн объекта на 1d4+1 на 1ход(закл)",
                actionType: "закл"
            },
            "Повышение градуса": {
                type: "Action",
                description: "огненный урн получаемый обьектом +1d4+1(прием)",
                actionType: "прием"
            },
            "Крышка": {
                type: "Action",
                description: "бонусое, в след ходу вы не можете получить :poisoned_icon: + :burn_effect_icon_high: + :bleeding_effect_icon_high:(закл)",
                actionType: "закл"
            },
            "Очищение": {
                type: "Action",
                description: "бонусное, СЛ:6, избавляет владельца от :poisoned_icon:(помощь)",
                difficulty: 6,
                actionType: "помощь"
            },
            "Прижигание": {
                type: "Action",
                description: "снимает :bleeding_effect_icon_high:, наносит 1урн(помощь)",
                actionType: "помощь"
            },
            "Добавка": {
                type: "Skill",
                description: "навык, Позволяет добавить к блюду на одну добавку больше(готовка)"
            },
            "Оптимизация": {
                type: "Action",
                description: "СЛ: 16, во время готовки возвращает один из ингредиентов обратно(прием готовки)",
                difficulty: 16,
                actionType: "прием готовки"
            }
        },
        "Ур3": {
            "Зашивание": {
                type: "Action",
                description: "бонусное, СЛ:7 снимает :bleeding_effect_icon_high:(прием)",
                difficulty: 7,
                actionType: "прием"
            },
            "Слепой опыт": {
                type: "Action",
                description: "вост 1d4+1хп за каждую позитивный эффект себе или союзнику, снимает все позитивные эффекты"
            },
            "Экономный режим": {
                type: "Action",
                description: "в конце дня вост транспорту 1d4+2 ен"
            },
            "Мастер нарезки": {
                type: "Skill",
                description: "навык, позволяет прибавить еще один d4 к любой нарезке"
            },
            "Полет дракона": {
                type: "Action",
                description: "3ен, хозяин: назад 3, все противники впереди, в пределе двух клеток получают::burn_effect_icon_high:(прием)",
                cost: 3,
                costType: "ен",
                actionType: "прием"
            },
            "Острый перец": {
                type: "Action",
                description: "2ен, 1d4 урн, 5 ходов атаки противника не имеют стихийного эффекта(закл)",
                cost: 2,
                costType: "ен",
                actionType: "закл"
            },
            "Восточные специи": {
                type: "Action",
                description: "3ен, бонусное, запрещают противнику на 1 ход использовать заклы(закл)",
                cost: 3,
                costType: "ен",
                actionType: "закл"
            }
        },
        "Ур4": {
            "Зельеварение": {
                type: "Action",
                description: "на среднем+ отдыхе может сделать случайное зелье из свеого списка рецептов, если в комнате есть котел, со СЛ:12, может создать на 1ед зелья больше(крафт)",
                actionType: "крафт"
            },
            "Счастливый случай": {
                type: "Skill",
                description: "навык, Востанавливает 2хп при двадцатке"
            },
            "Фаер болл": {
                type: "Action",
                description: "6ен, СЛ:5, урн по цели 2d4+2, и 1d6, соседним целям(закл)",
                difficulty: 5,
                cost: 6,
                costType: "ен",
                actionType: "закл"
            },
            "Любовное зелье": {
                type: "Action",
                description: "раз в день позволяет позволяет приготовить 1 Зелье очарование, не используя каких либо ингредиентов(крафт)",
                actionType: "крафт"
            },
            "Азот": {
                type: "Action",
                description: "бонусное, одно существо, выбирите сущ которое ходит после вас и его следующий бросок атаки, спасбросок или проверка характеристики автоматически получает тот же результат d20, который вы только что выбросили в свой ход(закл)",
                actionType: "закл"
            }
        },
        "Ур5": {
            "Начинающий настрой": {
                type: "Action",
                description: "5ен, раз в день можно моментально приготовить 1 блюдо, без каких лиюо затрат",
                cost: 5,
                costType: "ен"
            }
        },
        "Расовое": {}
    },
    "Жестокость": {
        "Ур1-2": {
            "Рукопашный бой": {
                type: "Skill",
                description: "навык, что позволяет наносить 1d4+сил урн в ближнем бою, не имея оружия, приемы с тегом 'рукопашный бой', также будут наносить 1d4+сил урн"
            },
            "Джеб": {
                type: "Action",
                description: "СЛ:9, игнорирует :arrmor_icon_high:, накладывает: :vulnerability_effect_icon_high:(рукопашный бой)(прием)",
                difficulty: 9,
                actionType: "прием"
            },
            "Взрывной щит": {
                type: "Action",
                description: "защ+2(1ход), если след ход противник не пробивает :arrmor_icon_high: хозяина то ему наноситься 1d6+2 урн(стойка)",
                actionType: "стойка"
            },
            "Сосуд для защиты": {
                type: "Action",
                description: "вост 2хп цели, весь урн переноситься на выбранного союзника(2ход)(стойка)",
                actionType: "стойка"
            },
            "Запугивание": {
                type: "Skill",
                description: "навык, Накладывает на врага эффект :stress_effect_icon_high:, если у врага мало хп то запугивание может завершить бой без лишней крови"
            },
            "Приказ пойти нахуй": {
                type: "Action",
                description: "СЛ сил:11, 1d4+1урн, заставляет существо пойти нахуй, если есть навык запугиванеи, оно выполняться на цель(закл)",
                difficulty: 11,
                difficultyType: "сил",
                actionType: "закл"
            },
            "Матерный разряд": {
                type: "Action",
                description: "накладывает на вас 2 уровня :provocation_effect_icon_high:(закл)",
                actionType: "закл"
            },
            "Охота на ветру": {
                type: "Action",
                description: "позволяет прибавить поинты скр транспорта к своему броску урона(прием)",
                actionType: "прием"
            },
            "Обман": {
                type: "Skill",
                description: "навык, Позволяет обманывать опонента и самого себя(лов)",
                stat: "лов"
            }
        },
        "Ур3": {
            "Удар с локтя": {
                type: "Action",
                description: "имеет урон рукопашки, если противник имеет: :vulnerability_effect_icon_high:, урн +1d4(рукопашный бой)(прием)",
                actionType: "прием"
            },
            "Удар поддых": {
                type: "Skill",
                description: "навык, что позволяет нанести на 1d4 урона больше в первый ход, в ближнем бою, макс ен -2",
                modifier: "-2"
            },
            "Кулаки чешутся": {
                type: "Skill",
                description: "навык, раз в день можно совершить, один прием бонусным действием"
            },
            "Рассекания": {
                type: "Skill",
                description: "Навык, Если в этом ходу основным действием ты атаковал, то бонусным действием ты можешь атаковать другую цель в зоне своей досягаемости но с помехой, перемещение между действиями недопускается(прием ближнего боя)"
            },
            "Подготовка удара": {
                type: "Action",
                description: "3ен, накладывает на владельца эффект :pressur_effect_icon_high:(закл)",
                cost: 3,
                costType: "ен",
                actionType: "закл"
            },
            "Таран": {
                type: "Skill",
                description: "Навык, Удар боком транспорта, не ломает ее"
            },
            "Потрошения": {
                type: "Skill",
                description: "Навык, Во время нарезки мяса можете добавить к броскам еще d4"
            },
            "Парирование": {
                type: "Action",
                description: "5ен, если сущ не пробило вашу :arrmor_icon_high: в свой ход, то вы получаете возможность сразу же ее атаковать в ближнем бою, не потеряв свой основной ход, если атака была загатовленна реакцией, ен не тратиться(стойка)",
                cost: 5,
                costType: "ен",
                actionType: "стойка"
            }
        },
        "Ур4": {
            "Поспешность": {
                type: "Skill",
                description: "навык, макс хп -1, при двадцатке получаешь второй бонусный ход",
                modifier: "-1"
            },
            "Капкан": {
                type: "Action",
                description: "2хп, требуется: :in_shadow_effect_icon_high:, в радиусе 2 метров вы можете нанести всем противникам урон, равный урону вашего оружия, снимает: :in_shadow_effect_icon_high:(прием)",
                cost: 2,
                costType: "хп",
                actionType: "прием"
            }
        },
        "Ур5": {
            "Жестокий план": {
                type: "Action",
                description: "3ен, реакцией, можно перенести весь полученный урн со варга, на союзника(прием)",
                cost: 3,
                costType: "ен",
                actionType: "прием"
            }
        },
        "Расовое": {
            "Бодание": {
                type: "Action",
                description: "бонусное, противник: назад 3"
            },
            "Ядовитый плевок": {
                type: "Action",
                description: "3ен, 1d4урн, накладывает 2 уровня :poisoned_icon:",
                cost: 3,
                costType: "ен"
            }
        }
    },
    "Порядочность": {
        "Внимательность": {
            type: "Skill",
            description: "Навык что позволяет вам лучше замечать скрытые опасности и нужные предметы а таккже находить мелкие детали"
        },
        "Ур1-2": {
            "Второе дыхание": {
                type: "Action",
                description: "СЛ:5, бонусное действие, союзник получает +2 к след броску закла(прием)",
                difficulty: 5,
                actionType: "прием"
            },
            "Убеждение": {
                type: "Skill",
                description: "Навык(рзм)",
                stat: "рзм"
            },
            "Укройся за мной": {
                type: "Action",
                description: "3ен тратишь ход на то что бы укрыть союзника за собой и тот на 1 ход получил :in_shadow_effect_icon_high:(стойка)",
                cost: 3,
                costType: "ен",
                actionType: "стойка"
            },
            "Защитная стойка": {
                type: "Action",
                description: "3ен :arrmor_icon_high: +2 (2 хода)(стойка)",
                cost: 3,
                costType: "ен",
                actionType: "стойка"
            },
            "Уход в тень": {
                type: "Action",
                description: "СЛ:8, владелец получает: :in_shadow_effect_icon_high: (прием)",
                difficulty: 8,
                actionType: "прием"
            },
            "Чтение сказочки": {
                type: "Action",
                description: "СЛ:8, вы можете усыпить сущность(если она не враждебна), если она проваливает спас бросок лов, то она получает :sleepy_effect_icon_high: на 60сек(помощь)",
                difficulty: 8,
                difficultyType: "лов",
                actionType: "помощь"
            },
            "Упущенный момент": {
                type: "Action",
                description: "можете воздержаться от хода если выпала 20, при этом вост 4хп и 1ен(прием)",
                actionType: "прием"
            },
            "Ствол дерева": {
                type: "Action",
                description: "2ен, Полное спр перемещению(2хода) :arrmor_icon_high:+2(1 ход)(стойка)",
                cost: 2,
                costType: "ен",
                actionType: "стойка"
            },
            "Мелкая помощь": {
                type: "Action",
                description: "3ен, бонусное накладывает либо на себя либо на союзника эффект :regen_icon_high: (помощь)",
                cost: 3,
                costType: "ен",
                actionType: "помощь"
            }
        },
        "Ур3": {
            "Помощь в атаке": {
                type: "Action",
                description: "СЛ:7, накладывает на союзника эффект :pressur_effect_icon_high: (помощь)",
                difficulty: 7,
                actionType: "помощь"
            },
            "Оборот": {
                type: "Action",
                description: "Вост 1d4хп, за каждый негативный эффект на игроке, снимает все негативные эффекты(помощь)",
                actionType: "помощь"
            },
            "Любитель Мяты": {
                type: "Skill",
                description: "Навык, Позволяет использовать предмет класса: мороз, бонусным дейтсвием"
            },
            "Уход за техникой": {
                type: "Action",
                description: "потратьте средний+ отдых, что бы вост механизму 1d4+2 прочности(ремонт), еслив комнате есть верстат, востановление +2",
                actionType: "ремонт"
            },
            "Скрытность": {
                type: "Skill",
                description: "Навык, Позволяет без помехи использовать заклы и приемы что накладывают::in_shadow_effect_icon_high:(лов)",
                stat: "лов"
            }
        },
        "Ур4": {
            "Раздумья": {
                type: "Action",
                description: "в след ходу не атакующие заклы, или действия типа: помощь, совершаются с преимуществом(закл)",
                actionType: "закл"
            },
            "Экстренная помощь": {
                type: "Action",
                description: "раз в день, если товарищ находится при смерти ты можешь реакцией вост ему 1 хп(помощь)",
                actionType: "помощь"
            }
        },
        "Ур5": {
            "Второй шанс": {
                type: "Skill",
                description: "навык, находясь при смерти вост 1d4 хп, работает раз в день"
            }
        },
        "Расовое": {
            "Слабый телекинез": {
                type: "Action",
                description: "позволяет перемещать и поднимать мелкие предметы, ключи, ложки, листы. А также дистанционно двигать передвижные блоки"
            }
        }
    },
    "Амбиции": {
        "Ур1-2": {
            "Задержка": {
                type: "Action",
                description: "СЛ:2, 3ен, Бонусное действие, противник пропускает ход но в след раунде имеет в 2 раза больше ходов(закл)",
                difficulty: 2,
                cost: 3,
                costType: "ен",
                actionType: "закл"
            },
            "Замечание": {
                type: "Action",
                description: "3ен, накладывает::arrmor_icon_high:+2(2хода), и :provocation_effect_icon_high:x2(прием)",
                cost: 3,
                costType: "ен",
                actionType: "прием"
            },
            "Лёгкий флирт": {
                type: "Action",
                description: "СЛ:8, На 12сек налаживает на объект :charming_effect_icon_high: (закл)",
                difficulty: 8,
                actionType: "закл"
            }
        },
        "Ур3": {
            "Вперёд к славе!": {
                type: "Action",
                description: "В первом ходу позволяет всем членам команды, кроме хозяина, прибавить к след проверке 1d4(Боевой закл)",
                actionType: "боевой закл"
            },
            "Воодушевление": {
                type: "Action",
                description: "3ен, в начале боя или отдыха позволяет снять 1 стрс союзнику(помощь)",
                cost: 3,
                costType: "ен",
                actionType: "помощь"
            }
        },
        "Ур4": {
            "Любимчик": {
                type: "Skill",
                description: "навык, в конце игры получает бонусные 30 опыта"
            }
        },
        "Ур5": {
            "Отчаянный рывок": {
                type: "Action",
                description: "4хп, если игрок имеет меньше 6хп, он получает доп ход(закл)",
                cost: 4,
                costType: "хп",
                actionType: "закл"
            }
        },
        "Расовое": {}
    }
});